[{"courseCode":"B FOR 100","title":"Introduction to Information Systems ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course provides a foundation of information systems concepts that can be applied to future learning in advanced topics. The course will include background in the history and social implications of computing including cyber ethics; emergent and contemporary information technology and its nomenclature; information and data abstraction, representation, manipulation and storage; operating systems; networking and the Internet, programming languages, logic, and algorithms; database systems; digital graphics and multimedia; and information security.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 200","title":"Information Security for Business ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course presents students with foundational concepts and processes to achieve better information security in a modern organization. Students will be introduced to the fundamentals of computers and computer systems. Through this course, students will learn the basics of computers, hardware, peripherals, and networking. An overview and exploration of the software and technology foundations for cyber security will be examined. Students will develop an understanding of the threat landscapes and risk of information exposure, as well as mitigation techniques to limit losses. Modern information security technologies and their limitations will be explored as well as the legal, ethical, and privacy issues. This course will give students the foundational knowledge and skills to understand information security.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 201","title":"Introduction to Digital Forensics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"In this course, students will learn the fundamental process of analyzing data collected from electronic devices (including computers, media, and other digital evidence). Students will become familiar with proper techniques and tools utilized for securing, handling and preserving digital and multimedia evidence at physical crime scenes. Students will utilize examination and chain of custody forms, as well as prepare crime scene and digital acquisition reports related to administrative, civil and criminal investigations. Only one version of B FOR 201 may be taken for credit. Offered fall and spring semesters.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 202","title":"Cyber Crime Investigations ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course will teach students forensic investigative techniques specifically for managing cyber crimes including collection and preservation of data from different sources, such as the Internet and \"cloud\" computing environments. Students will learn the legal processes available for collecting and preserving such evidence in conducting cyber investigations. Only one version of B FOR 202 may be taken for credit. Offered fall semester only.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 203","title":"Networking and Cryptography","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course will cover three primary areas of networking: Networking Components, Secure System Design fundamentals, and Cryptography. In this class, students will gain a basic understanding of network components, their roles, and how they interact in systems. Basic network architectures will be covered, and how they relate to specific host/client needs. Students will learn how to track and identify the packets involved in a simple TCP connection. They will learn to use networking tools such as WireShark, and network mapping tools, such as NMap. A thorough understanding of the first principles of security will be conveyed, including why each principle is important, and how it enables the design and development of security mechanisms that can meet and implement security policies. Security failures will be analyzed so that students can learn to identify: the specific failures; the design principles that have been violated; which principles are needed in specific scenarios. Human/machine interface principles will be discussed, and their importance in design and usage. Students will explore the connections between security and usability, and the importance of minimizing the effects of security mechanisms.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 204","title":"Introduction to Cybersecurity","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course provides students with foundation for future learning in information security. Students will be exposed to information security terminology and concepts and apply them through labs and exercises throughout the course. First, students will be given a recap of networking concepts related to information system including the OSI/Internet models and TCP/IP protocol suite. Subsequently, the class will learn of different threats and motivations as well as the types of cyber attacks. Attacks covered in the course include, malware, protocol based attacks (spoofing, session hijacking, caches poisoning, etc.), Denial-of-Service, and attacks on the web. Also included in this course are psychological aspects of information security, vulnerabilities of computer networks, and cyber warfare. Prerequisite(s): B FOR 203.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 205","title":"Introduction to Database Systems ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"Database systems are extensively used where large amounts of data must be stored for efficient update, retrieval, and analysis. The purpose of this course is to provide a comprehensive introduction to modern database management systems (DBMS). Students will learn to create databases and database objects, solve problems by constructing database queries using Structured Query Language (SQL), and practice data modeling and data normalization techniques. Students will also develop insights into advanced data management topics and technique trends.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 206","title":"Programming for Analytics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course introduces students to programming concepts that will help them in the process of data analytics. Students will learn to use shell scripting language to quickly sort, search, and clean data as well as the more structured Python language to process large data sets. Students will be expected to have basic familiarity with the Linux operating system as well as basic programming constructs such as loops, logic statements, and variable declaration. Students will be expected to both complete programming assignments as well as engage in data analysis employing the programming skills learned in the class. Prerequisite(s): B FOR 100.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 210","title":"Information Security Practicum ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This is a course for School of Business majors, with sophomore status, who are interested in pursuing a career in security risk consulting. Students will be exposed to case studies and will be guided through research and strategy development by professionals. Weekly sessions with client-serving professionals who will mentor students to build and enhance their technical skills as well as leadership, consulting, project management, and teamwork skills. Only one of B ITM 210 and B FOR 210 may be taken for credit. Prerequisite(s): permission of instructor.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 211","title":"Project Mentorship ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course builds up on the trajectory course, BFOR 210, where students act as security risk consultants working with a firm. The students will serve as mentors to and assist students enrolled in BFOR 210. In addition, students will work with the instructional team in reviewing and evaluating student work and presentations as well as participate in weekly calls with the \"client.\" In the process, students will also gain knowledge in the new case topic used for the current class (usually a topic in emerging technology, e.g., Cloud computing, social media, information security risk assessment). Students in this course will interface with the instructor(s) for BFOR 210 and will interface with firm in development of, research for, and evaluation of cases and case materials. Only one of B ITM 211 and B FOR 211 may be taken for credit. Prerequisite(s): BFOR 210 and permission of instructor.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 300","title":"Databases for Digital Forensics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"A large part of digital forensics deals with extraction and collection of data across electronic devices each of which has different architecture. In this class students learn the traditional relational database design and then understand the architecture of data storage in mobile electronic devices. The class also discusses in depth the storage of data on the cloud and the ramifications of that on digital forensics. Students also learn the basic techniques for analyzing data including use of Structured Query Language, data mining techniques and social network analysis. Students will also use scripting languages to efficiently clean up data from text files and extract information from files. Prerequisite(s): B FOR 100 or permission of instructor. Offered fall semester only.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 301","title":"Computer Forensics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course prepares students to conduct digital forensic examination of computers, removable media and other electronic devices. Students will use digital forensics tools and techniques to analyze digital evidence pursuant to an investigation, while utilizing industry standards and best practices. This course will prepare students in the development and implementation of forensic incident response plans, policies and procedures. Students will engage in oral and written reporting outlining digital forensic analysis findings and conclusions, in a professionally acceptable manner, pursuant to administrative, civil and criminal legal proceedings. Prerequisite(s): B FOR 201.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 302","title":"eDiscovery Forensics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course prepares students for the electronic collection, preservation and management of corporate information. It provides a foundation on basic corporate incident response challenges and proper collection methods for electronic data subject to legal and regulatory requirements. Students will utilize forensics tools for searching, culling and presenting corporate data, pursuant to administrative and civil eDiscovery cases. Offered fall semester only.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 303","title":"Computer and Memory Forensics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course prepares students to conduct a digital forensic examination and analysis involving complex cases, electronic devices and data, as well as other forensic processes utilized to ensure government and corporate continuity. This course will demonstrate the importance of memory forensics through memory analysis with Windows, Linux, and Mac OS X. This course will prepare students to develop and implement policies and procedures for computer forensic laboratories involving operations and quality control management. It prepares students to compose and present oral and written reports that include laboratory audits, forensic analysis findings and court presentation material. Prerequisite(s): B FOR 201.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 304","title":"Mobile Forensics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course provides students with an overview of mobile forensics investigation techniques and tools. It exposes students to procedures for conducting live network forensics of mobile devices and data. Students will learn mobile forensics procedures and principles, related legal issues, mobile platform internals, bypassing passcode, rooting or jailbreaking process, logical and physical acquisition, data recovery and analysis, and reporting. This class provides in-depth coverage of iOS and Android platforms and prepares students to collect, preserve, and examine mobile data that may be critical to an investigation. Students will develop network incident response plans, policies and procedures relevant to corporate networks and data, as well as mobile corporate assets, such as mobile devices. It prepares students to compose and present oral and written reports that outline network and mobile device forensic analysis findings that are technically and legally acceptable in administrative hearings and court proceedings. Prerequisite(s): B FOR 201.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 305","title":"Cyber Defense ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course provides students with a deep dive into cyber security tools. Topics covered in this class include techniques for protecting networks and data, basic elements of symmetric and asymmetric cryptography, secure e-commerce, secure transmission, authentication, digital signatures, digital certificates and Public Key Infrastructure (PKI). The course will also discuss current legislation and standards related to information security and their relevance to the international workplace. Prerequisite(s): B FOR 204.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 306","title":"Database Security and Forensics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"Students will learn the security and forensics aspects of databases, specifically, assessment and analysis of database best practices that include: data security policy, access control, intrusion detection, data obscurity, fraud detection, encryption, virtual private databases and physical security. Prerequisite(s): B FOR 204 and B FOR 205.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 400","title":"Forensic Accounting and Fraud Detection ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course provides an overview of occupational fraud including misappropriation of assets, financial statement fraud and corruption as well as other forensic accounting engagements such as tax fraud and matrimonial disputes. The course will explore the characteristics of specific fraud schemes along with the characteristics of those who perpetrate them (according to the Annual Report to the Nations compiled by the Association of Certified Fraud Examiners). Students will acquire an understanding of the generally accepted accounting principles violated by the schemes. Students will become versed in the principles of internal control over the financial reporting system including how these principles work to deter financial fraud and ensure compliance with external requirements. Relevant guidance from the professional, regulatory and legal environment will be discussed. Prerequisite(s): B ACC 211. Offered fall semester only.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 401W","title":"Advanced Digital Forensics ","courseCredits":" (4 credits)","department":"Digital Forensics","description":"Instructor will guide students through proficiency testing by utilizing digital forensic skills obtained in previous coursework to develop an incident response plan to guide a forensic investigation. Based on case-study scenario, students will also conduct forensic analysis of several items of digital evidence, prepare comprehensive written forensic laboratory reports and present findings to a panel of legal, forensics and management subject matter experts for constructive feedback. Students will also prepare exhibits and other materials for court presentation purposes based on the case-study scenario, forensic analysis findings and written laboratory reports. Instructor will conduct quality control assessments to ensure students are performing forensic analysis that is in compliance with industry standards guiding forensic and laboratory work environments. Prerequisite(s): B FOR 301 and B FOR 303. Offered fall semester only.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 402","title":"eDiscovery Forensics and Moot Courts ","courseCredits":" (4 credits)","department":"Digital Forensics","description":"Electronic discovery (eDiscovery) refers to any process in which electronic data is sought, located, secured, and searched with the intent of using it as evidence in a civil or criminal legal case. This course will teach students the process of eDiscovery and developing testimony that can be presented in courts. The course will involve presenting evidence through the use of moot court. Prerequisite(s): B FOR 201 and R CRJ 202 or B LAW 220.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 403","title":"Risk Analysis & Security Policies ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"As the pervasiveness and frequency of security attacks continue to become commonplace, every organization needs to have a strategy for managing security risks. Cybersecurity and Digital Forensics professionals need to have the expertise to assist organizations manage security risks. This course is designed to introduce students to the field of information security risk. The course will explore the phases of a risk management program, focusing on the processes for analyzing and assessing risk. Students will learn how to quantitatively and qualitatively assess risk, how to measure risk, and how to develop security policies for mitigating risk. The course will incorporate common cases to provide a holistic view of how to properly use tools to calculate the costs and benefits of security investments. Prerequisite(s): B FOR 204 and B FOR 305.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 404","title":"Forensic Accounting Investigative Techniques ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"Students will learn the process and principal techniques for conducting fraud examinations and other forensic investigations as well as why careful attention to them is critical to a successful investigation. Students will learn the role of analytical review procedures in the investigation of financial fraud. Document analysis and the art of effective interviewing during investigations will be explored. Students will learn the proper procedures for evidence handling. Finally students will learn to write a report that succinctly and effectively communicates the completed investigation. Relevant guidance from the professional, regulatory and legal environment will be discussed. Prerequisite(s): B ACC 400. Offered spring semester only.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 410","title":"International Cyber Conflicts ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"Cybersecurity is an international problem where the perpetrators and victims of attacks may be in completely disparate locations. Cyber attacks have morphed from cyber crime and amateur display of prowess into cyber warfare and espionage among nations. While the issues are international there is little consensus on how to investigate them, create universally acceptable norms, and create international laws across multiple countries to manage them. This course discusses some of these sensitive issues regarding information security and cyber warfare. The hope is to improve understanding between professionals and students across countries in order to foster cooperation in resolving cyber conflicts. The class will include cases and discussions that will touch on the sensitive security related topics.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 411","title":"Supervisory Control and Data Acquisition (SCADA) Forensics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"Supervisory Control And Data Acquisition (SCADA) systems are computer systems controlling large-scale, industrial equipment, often underlying important infrastructural assets such as power plants, water distribution facilities, and communication networks. This class is intended to familiarize students with how to forensically investigate and secure SCADA system. Due to the nature and impact of SCADA systems on human lives they typically have more requirements than standard systems. Because SCADA systems are imbedded into critical infrastructure it is vital to understand the regulatory compliance and system governance associated with these systems. As recent events, both domestically and internationally, have demonstrated, SCADA forensics skills are increasingly important and in demand today. Prerequisite(s): B FOR 201.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 412","title":"Cyber Incident Response and Penetration Testing ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course will discuss detection, management, and recovery from different types of incidents. Detecting and responding to security incidents are important parts of managing information security in an organization. Despite the best security infrastructure and policies in place, security incidents are inevitable. Each type of incident requires a specific handling process. Students will learn to identify the data sources, e.g. log files, and how to process the data into a meaningful analysis format. The class will cover analysis of individual files, as well as techniques to correlate information across multiple log sources to build a chain of evidence across those log files. Students will perform hands-on work during the tutorial using data sets that are representative of real life incidents. By the end of class, students will understand and be able to perform full scale cyber incident response. Prerequisite(s): B FOR 204, B FOR 206, and B FOR 305.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 413","title":"Multimedia Forensics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course prepares students to conduct digital forensic examinations on multimedia evidence, specifically images, videos and audio files. The course builds student knowledge from the basics of multimedia types to being able to recognize anomalies in the files and identify file creation attributes. Students will learn how to examine multimedia files manually and through automated processes utilized by digital forensic tools. Students will prepare written reports outlining their findings of analysis, in a professionally acceptable manner, pursuant to administrative, civil and criminal legal proceedings. Prerequisite(s): B FOR 201.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 414","title":"Cyber Threat Modeling ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course is an introduction to cyber threat modeling from a variety of perspectives. Included in the course are threat modeling, application of cyber threat intelligence, analysis of technical threats, 360-degree cyber threat analysis techniques, data and information sources that feed the threat analysis cycle and hands-on exercises using security data. The course is heavily lab-oriented and each class will have a specific lab objective to be achieved by students working in teams of two. Periodic quizzes will make up the testing portion of the course but instead of a mid-term and final exam there will be a final lab exercise that will involve all of the tools and techniques used during the course. That final lab will be constructed from real world events occurring during the final half of the semester. Students also will prepare a research project and present it both as a formal paper to be turned in and a class presentation. Prerequisite(s): B FOR 203, working knowledge of networking (TCP/IP protocol stack).","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 415","title":"Hacking for Penetration Testers ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"In this course, students will learn the tools, attacks, techniques, strategies and tactics to jump start their penetration testing career and infiltrate any network or system. This hands-on, how-to course gives students an in-depth overview of penetration testing and how to test for computer/network/web vulnerabilities. From internal to external hacking, students will be able to understand the vulnerabilities that an attacker could exploit. Throughout the course, the students will have the opportunity to work with various tools, attacks, software, and tactics. Prerequisite(s): B FOR 203, B FOR 204, B FOR 305.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 416","title":"Advanced Data Analytics ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This is a course with primary application to data analytics from a variety of domains, such as healthcare, finance, e-commerce, social media, etc. Learning objectives for students are to broadly understand the widely used machine learning algorithms and to gain hands-on experience with data preprocessing, feature extraction, and information visualization, when applying the learned algorithms to solving practical problems. A basic understanding of engineering and technology principles is strongly encouraged, including basic programming skills as well as sufficient mathematical background in probability, statistics, and linear algebra. Prerequisite(s): A MAT 108 or R CRJ 281 and B FOR 206.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 418","title":"Assembly Language and Malware Reverse Engineering ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"Reverse engineering of malware is the process of examining the disassembled code of malware via a disassembler or hex editor to better understand the code logic. The analysis helps understand the behavior of the malware by executing it in a quarantined environment to prevent contamination of the rest of the environment. The behavior could include files accessed, network communication, and processes launched, etc. The class also covers fundamentals of assembly language and hex editing which are useful for the code analysis. Students will be able to use code disassemblers to generate assembly language code from machine-executable code. Students will also learn about different types of malware and how to fingerprint malware. Prerequisite(s): B FOR 204 and B FOR 206.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 419","title":"System Administration & Operating Systems Concepts ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"A practical study of the secure management of multiple internet connected server and workstation computers. System setup and periodic maintenance (with topics such as OS installation, filesystems, application server software builds, patching, performance monitoring) combined with issues of availability (including networking and remote access, backup and restores, user accounts) and interoperability issues. Prerequisite(s): B FOR 100.","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"B FOR 420","title":"National Cybersecurity Challenge Problems ","courseCredits":" (3 credits)","department":"Digital Forensics","description":"This course exposes students to national cybersecurity challenge problems that our National Labs are currently dealing with and is suitable for seniors who are majors in Digital Forensics, Computer Science, Mathematics, and Cybersecurity. This is an experiential learning course where student teams will work closely with the faculty instructor and scientists in a National Lab or a Government Agency dealing with cybersecurity or intelligence problems. Students will work in teams to plan and solve the problems","school":"School of Business","degree":"B.S. in Digital Forensics"},{"courseCode":"ITM 604","title":"Data Communications, Computer Networking and Computer Security ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"This class introduces communications and networking concepts, including types of networks, data/signal transmission, basic ideas such as error control and multiplexing, as well as the costs and benefits of different wired and wireless media and communications hardware. It covers network topologies, the OSI/Internet models, associated protocols (TCP/IP), network architectures, and network routing and switching. Information security concepts are introduced, including common risks to information systems and their controls. Specific areas covered include wireless security, application security, password security and access control, cryptography and secure electronic commerce (PKI, digital certification, digital signatures, and other electronic authentication), intrusion detection/prevention, incident response, and computer forensics. Students also perform a risk analysis exercise using a real-world case and learn to develop information security policy. Prerequisite: ITM 522 or permission of instructor.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 640","title":"Information Security Risk Assessment ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"This course provides students with an introduction to the field of information security risk assessment. Initially, the students will be introduced to basic definitions and nomenclature in the area of security assessment. Thereafter they will be taught different approaches for assessment of risk. The course will incorporate cases in risk analysis derived from state and law enforcement agencies. Students will learn how to use a risk analysis matrix for performing both quantitative and qualitative risk analysis. As part of the course the students learn of the different threats that they need to incorporate in their risk analysis matrices.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 641","title":"Security Policies ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"This course provides students with an introduction to information security policies. Students will be introduced to sociological and psychological issues in policy implementation in general and then provided with a focused dialogue on information security specific policies. The class discusses the entire lifecycle of policy creation and enactment and presents students with issue specific policies in different domains of security. The structure of the policy is also discussed to assist the students in design and modification of policies. Several examples from different domains are incorporated in the curriculum to assist students to learn in context of real life situations.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 642","title":"Computer Forensics ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"This course prepares students to conduct a computer forensics investigation as prescribed by the National Institute of Justice (NIJ). Students will be introduced to computer forensics concepts, as well as techniques for identifying, collecting, preserving and triaging digital evidence consistent with industry standards and best practices. Students will become familiar with assorted hardware and software utilized by computer forensic practitioners","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 643","title":"Incident Handling ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"The course primarily involves management of computer security incidents, including detailing different types of incidents, identification, preparation, and analysis of incidents; as well as gathering of evidence, recovery and follow-up to computer security incidents.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 644","title":"Introduction to Information & Cyber Security ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"In this class, vulnerabilities of computer networks and techniques for protecting networks and data are discussed. Basic elements of symmetric and asymmetric cryptography, secure e-commerce, involving secure transmission, authentication, digital signatures, digital certificates and Public Key Infrastructure (PKI) is presented. Issues in privacy and piracy are also discussed where students study and debate controversial topics such as media piracy and government surveillance.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 645","title":"Psychology & Information Security ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"This course provides students with an appreciation for and understanding of the psychological processes that impact information security. Three broad themes are covered. The first explores the psychology of the attacker, and examines the motivation and techniques of cyber criminals and hackers. The second theme stresses the importance of the user in the success of security systems. Students will be introduced to basic perceptual, cognitive, and motivational processes and biases that compromise security and increase vulnerability to attacks. The third theme examines how humans interact with machines and technology and how this interaction affects security in organizations.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 646","title":"Mathematical Models for Information Security ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"This course teaches students to navigate sections of classical mathematics and computer science used to construct mathematical models of information security. This course will help students understand the need for mathematical models in different security paradigms along with the essential definitions, concepts and results for developing the models. The course will also help students figure out the limitations of the mathematical model: its strengths and weaknesses, and, consequently, its application to practical problems. The student will know what specific areas of mathematics and computer science will be necessary for the problems at hand and where further investigation is required.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 647","title":"Security Implementation","courseCredits":"","department":"Information Technology Management","description":"This course will teach students how to implement security in networks. Students learn how to harden their information security environment and set up secure infrastructure. The course covers both wired and wireless network security, database security, and general computer security practices.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 691","title":"Field Study in Information Technology Management ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"Field projects are conducted by students under faculty supervision in a variety of business and not-for-profit organizations. The projects provide students with an opportunity to apply and further develop their skills in information technology management. Must be repeated for 3 credits. Prerequisites: ITM 522 and permission of the department chairperson.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ITM 695","title":"Independent Study in Information Systems or Information Technology ","courseCredits":" (3 credits)","department":"Information Technology Management","description":"The student and instructor jointly develop a plan of independent study on an advanced topic in information systems or operations management. The student is usually required to prepare a report or paper. May be repeated for a total of 3 credits. Prerequisites: ITM 522 and permission of instructor and department chairperson.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ACC 522","title":"Statistical Methods for Forensic Accounting and Assurance ","courseCredits":" (3 credits)","department":"Accounting","description":"Exploratory descriptive data analysis using Data Analysis & Mining Software. Basic graphics commands in S-Plus including trellis graphics. Descriptive data exploration and statistical modeling. Data processing for Datamining. Classification: Induction of Decision trees, Association Rules in Large Databases. Multivariate Methods; Clustering and other multivariate statistical methods. Anomaly detection. Prerequisites: ITM 220 or MAT 108 or equivalent.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ACC 553","title":"Digital Forensics ","courseCredits":" (3 credits)","department":"Accounting","description":"The objectives of the course are to learn what are incidents, why they occur, who/what causes them, how to detect them, what are the preventive/protective measures that organizations can take, what to do when they do occur, when do they need to be reported and to whom. We will learn the various types of incidents, what to do in case of each to protect the evidence, prevent gaps in chain of their custody. In particular, we will learn how and what kinds of evidence to obtain, how to prevent evidence from getting lost or destroyed, how to ensure that the evidence is admissible. We also will learn what is evidence, what are different types of evidence, basic rules on collecting, handling, and documenting evidence. Prerequisite: ACC 512.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ACC 581","title":"Internal Controls and Financial Information Systems ","courseCredits":" (3 credits)","department":"Accounting","description":"This course addresses the design and evaluation of computer-based accounting information systems with a focus on the recognition and identification of information technology risks. General and application internal controls for information systems environments are examined across client/server, end-user computing, and service bureau internal control environments. Both computerized auditing techniques as well as techniques for auditing computerized systems are analyzed. Risks of emerging technologies and computer-based business models for planning and control are considered.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"ACC 661","title":"Auditing of Advanced Accounting Systems ","courseCredits":" (3 credits)","department":"Accounting","description":"Auditing of modern complex accounting information systems. General & application controls and the design & development of generalized audit software. Auditing of operating systems and database management systems. Privacy & security of data in accounting systems. Audit of on-line systems, management systems. Prerequisite: ACC 512 or equivalent.","school":"School of Business","degree":"Graduate Certificate in Information Security"},{"courseCode":"C EHC 101","title":"Introduction to Emergency Preparedness, Homeland Security and Cybersecurity ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"From hackers to hurricanes, suicide bombing to supply chain interruptions, infrastructure failures to infectious disease outbreaks, the nation's governments, companies and non-profits must prepare for, protect against, respond to, and recover from a growing array of risks and threats. The fields of emergency preparedness, homeland security and cybersecurity are central to those efforts, and there is an ever growing demand for individuals prepared in these areas. Through lectures, discussion, and case studies, students in this course will develop a broad theoretical, substantive, and practical understanding of the fields of emergency preparedness, homeland security and cybersecurity. Students will be exposed to various ways to think about, measure, assess and compare risks, as well as how to mitigate them and respond to incidents that do occur. The three disciplines will be explored through the crosscutting themes that tie them together, including prevention, incident management and response, crisis communication, recovery and resiliency. Only one version may be taken for credit.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 210","title":"Critical Inquiry and Communication in Emergency Preparedness, Homeland Security and Cybersecurity ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This course builds upon UUNI 110's focus on critical argumentation, analysis and communication in the context of emergency preparedness, homeland security and cybersecurity. Students will learn to build and evaluate arguments, gather and evaluate evidence, and present conclusions within the context of emergency preparedness, homeland security and cybersecurity by writing briefs and conducting briefings.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 242","title":"Cybersecurity","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"The purpose of this class is to acquaint students with the policy issues associated with cybersecurity, this includes issues like cyber-attacks, network security, incident response, cyber crime, cyber espionage, and cyber conflict. Students will look at how government agencies and private sector entities assess and respond to the changing cybersecurity landscape -- how they assess the risks they face, how they manage those risks through security procedures and practices, and how they mitigate the impact of attacks that do happen on their systems. Prerequisites(s): C EHC/R PAD 101.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 310","title":"Research Seminar in Emergency Preparedness, Homeland Security and Cybersecurity ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"In many undergraduate classes, students are consumers of research created by others. Students read historical case studies of disasters, examine regression results of probing the relationship between democracy and terrorism, peruse interviews with government officials from homeland security agencies and scrutinize surveys of public opinion of privacy and security. What is often unclear is the research process lurking behind these final results. The mission of this course is to shed light on the research process in the areas of emergency preparedness, homeland security and cybersecurity. Over the course of the semester, students will conduct literature reviews, develop hypotheses, construct research designs, collect data, test hypotheses, and communicate findings. Students will start by creating a literature review on a topic of the student's interest, identifying a falsifiable research question of interest to them in an area related to his or her concentration and subsequently investigating the question using the procedures and methods of social science. Prerequisite(s): C EHC/R PAD 101 and C EHC 210.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 340","title":"Contemporary Issues in Security and Preparedness ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This course explores contemporary issues related to security and preparedness. Topics will vary from semester to semester based on the most pressing issues facing policy makers in Washington DC, such as homeland security, emergency preparedness, severe weather, cybersecurity, critical thinking, leadership, ethics, immigration, terrorism, risk analysis, digital forensics, critical infrastructure, transnational crime, border security, and privacy and civil liberties. Prerequisite(s): one of C EHC 101 or R PAD 140 or R POS 101 or R POS 102; one 300 level course in C EHC, R PAD or R POS; junior or senior standing; or permission of the Department.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 341","title":"Washington in Perspective ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This course uses different policy areas to examine the institutional structures, key non-state actors, and domestic and international context of American government. Course faculty will take advantage of the course location in the nation's capital and include field trips and guest speakers. Prerequisite(s): one of C EHC 101 or R PAD 140 or R POS 101 or R POS 102; one 300 level course in C EHC, R PAD or R POS; junior or senior standing; or permission of the Department.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 342","title":"Semester in Washington Internship ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This course is the internship component of the Semester in Washington program in the fall semester. Admission is by application. Enrollment is limited. Three of the nine credits may be used to satisfy the requirement for the C EHC 390 internship course in the BA/BS in Emergency Preparedness, Homeland Security, and Cybersecurity. Prerequisite(s): one of C EHC 101 or R PAD 140 or R POS 101 or R POS 102; one 300 level course in C EHC, R PAD or R POS; junior or senior standing; or permission of the Department. S/U graded.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 343","title":"Homeland Security ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This undergraduate survey course introduces students to the U.S. government response to the attacks of September 11, 2001, specifically, the second largest reorganization of the executive branch that produced the U.S. Department of Homeland Security. Topics examined include border and transportation security, customs, immigration policy and enforcement; preparedness and capabilities building, response and resilience; critical infrastructure protection; threat and vulnerability assessment and risk management; cybersecurity; counter-terrorism. Although the course is primarily focused on U.S. Federal government activities, it will also examine state and local dimensions of homeland security as well as U.S. government interactions with other countries in the homeland security domain. Only one version may be taken for credit. Prerequisite(s): C EHC/R PAD 101 or permission of instructor.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 344","title":"Emergency Preparedness ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This course provides a study of applicable policies, protocols, and laws that impact the practice of emergency preparedness at the federal, state, and local levels of government. The study includes a brief review of the history of emergency management setting the stage for an examination of \"best practices\" and philosophies. These drive the nation's preparedness, response, recovery, and mitigation efforts of various levels of emergencies and disasters which in turn helps facilitate a community's resilience in the face of disasters. The methodology used in this course includes classroom discussions and activities, studies of applicable case studies, and individual exploration resulting in a well crated paper. Where applicable, simulation activities provide opportunities for the student to \"experience\" realistic situations similar to real-world emergencies and disaster operations. Only one version may be taken for credit. Prerequisite(s): C EHC/R PAD 101 or permission of instructor.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 345","title":"Leadership and Ethics in Emergency Preparedness, Homeland Security and Cybersecurity ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This course provides a foundation for applying philosophical and ethical understanding to homeland security professions by drawing on both theoretical and practical approaches. It includes an overview of philosophical theories of ethics and political philosophy relevant to security practices and policies, as well as opportunities to develop critical thinking and communication skills in their application to particular cases related to homeland security through analysis and discussion. Historical and contemporary material will be examined to investigate issues such as the right to privacy, the nature and value of freedom, the justification of state security, and rights and responsibilities of public officials and health professionals. Prerequisite(s): C EHC/ R PAD 101 or permission of instructor.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 350","title":"350 Cybersecurity Case Analysis - The Threat Within ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"A new operating reality is confronting public and private sector organizations and institutions of all shapes and sizes everywhere: the threat from within that is able to exploit and expose an organization's greatest competitive edge  the \"secret sauce.\" Initially many experts thought of the insider threat challenge as a technical problem to solve. However, if there is anything that one of the largest and most damaging data breaches in U.S. Government history  Edward Snowden  has taught us, it is that this challenge is simply not one dimensional. Insider threats can surface at the strategic, operational and tactical layers of an organization, and therefore, the solution needs to be comprehensive, logical, and balanced. In this course, students from a variety of disciplines will work in teams of six to eight students with course faculty, student liaisons, and industry experts as mentors using an online/cloud communication platform. The goal of the course is to enable students to analyze realistic case scenarios and identify the depth and breadth of the cybersecurity challenge from multiple perspectives. Students will focus on the interrelated dimensions of the threat (which may include but are not limited to technical, procedural, legal, behavioral, skills/proficiencies) and the spectrum of constituent cyber domains/functional areas in which to identify solutions. Prerequisite(s): sophomore, junior, or senior standing.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 390","title":"External Internship in Emergency Preparedness, Homeland Security and Cybersecurity ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This course is intended to give students an opportunity to effectively apply what they have learned in their classroom studies through work in relevant professional settings. Students will secure placement at an off-campus agency or organization, including public, private, and not-for-profit organizations. Alongside that internship, there will be an accompanying class meeting in which students will integrate the theoretical concepts that they have learned in their courses with the practical experience of their internship as well as engage in career preparation activities. May be repeated for a maximum of 6 credits. Prerequisite(s): C EHC/R PAD 101 and junior or senior standing.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 391","title":"Research Internship in Emergency Preparedness, Homeland Security and Cybersecurity ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"The research internship provides students with insight into the personal qualities and skills that make a good researcher, as well as learning about the broader impact of scientific discovery. While working alongside a faculty member students will be able to hone their research and analytical skills, through hands-on experiences. While each course design will vary, students will primarily be involved in library research, compiling literature reviews, data collection, programming and/or data analysis. Students may repeat the course for a maximum of 6 credits. Prerequisite(s): C EHC/R PAD 101 and junior or senior standing.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 393","title":"Simulation: Building Security and Preparedness ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This is an intensive four week course that provides the student with an opportunity to blend \"practice\" with \"theory\" through a mix of high-end simulations and other blended learning activities. The course is typically offered in four week blocks of time and includes a blend of on-line readings, discussions, and related activities, capstone writing activities, and a residential one week mix of face-to-face classroom instruction with intensive simulation activities. The topics for the simulation course will vary with each one focusing on a core theme within the emergency preparedness, homeland security and cybersecurity framework. This course may be repeated once for credit when content varies. Prerequisite(s): junior or senior standing or permission of instructor.    ","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 394","title":"Exercise Design and Implementation ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"Through this course, students will learn to develop, execute, and evaluate exercises that address the priorities established by an organization's leaders. Based on the National Preparedness Goal, risk assessment concepts, and social scientific insights, this course will engage in a progressive exercise development program across a number of different disaster scenarios (natural, technological, and intentional). Methods of conducting and evaluating exercises are discussed and analyzed, and each student participates in producing, conducting and evaluating a disaster exercise. C EHC/R PAD 101, C EHC/R PAD 343, C EHC/R PAD 344 and junior or senior standing.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 398","title":"Field Experience in Emergency Preparedness, Homeland Security and Cybersecurity ","courseCredits":" (0-9 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This course provides academic structure and oversight to service-learning and community engagement components available as options in other Emergency Preparedness, Homeland Security and Cybersecurity offerings. The goal of the field experience course is to improve students' understanding of a topic explored during a semester length course. Courses will typically include guest speaker events, field excursions, and class session on-site (i.e. Puerto Rico, Oklahoma, Fukushima Japan, etc.) The course topic will change from semester to semester based on the topic of the semester length course. A version of the course could be used to offer a stand-alone course with service learning, community service, internship and other community engagement activities as a central theme.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 410","title":"Capstone Project in Emergency Preparedness, Homeland Security and Cybersecurity ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"Capstone Projects are designed to be the synthesizing educational experience for students majoring in Emergency Preparedness, Homeland Security and Cybersecurity. The experience provides students with an opportunity to apply the skills and knowledge acquired in their academic careers to solve a problem for a client. The Capstone Project requires students to engage in higher-order intellectual activity such as analysis, synthesis, and evaluation in a new or novel situation. In addition, students are expected to communicate the results of this intellectual activity in oral or written form to an appropriate audience. Capstone Projects are student-centered experiences that demonstrate that the students have become independent learners. Prerequisite(s): C EHC/R PAD 101, C EHC 210, and C EHC 310 and permission of instructor.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C EHC 495","title":"Special Topics in Research, Applied and Experiential Learning ","courseCredits":" (3 credits)","department":"Emergency Preparedness, Homeland Security and Cybersecurity","description":"This course is designed to discuss selected topics related to research, application, and experiential learning in the fields of emergency preparedness, homeland security, cybersecurity, and informatics. Through the lectures, readings and class discussions students will develop a broad understanding of the different fields and their specific topics. The topics will be selected and announced by the instructor when offered. May be repeated for credit if content varies. Prerequisite(s): permission of instructor and junior or senior standing.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Cybersecurity"},{"courseCode":"C INF 100X","title":"Information in the 21st Century ","courseCredits":" (3 credits)","department":"Informatics","description":"Introduction to information and technology in the 21st Century. Different resources, including the Internet, libraries, news sources and other sources of information, hardware, and Web 2.0 technologies will be explored. The primary emphasis of the class is on discovering reliable information sources for any and all subjects so that a student's future research and other pursuits are supported by the methods developed in this course. Each student is called upon to fortify their own individual communication and reasoning skills and will demonstrate the use of those skills through course assignments, class presentations and group activities.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 108","title":"Programming for Problem Solving ","courseCredits":" (3 credits)","department":"Informatics","description":"Ever thought about a problem and said, \"There should be an app for that\"? This course provides an introduction to computer programming using modern programming languages as a way to solve problems. It focuses on programming concepts and fundamentals within the context of solving real world problems","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 124X","title":"Computer Security Basics ","courseCredits":" (3 credits)","department":"Informatics","description":"An introduction to security in computer and network systems for a general audience. The operation of computers and networks is explained to show how they are the basis for attacks. The course will confer a basic but comprehensive understanding of how cybersecurity attacks (e.g., viruses, worms, denial of service) work. It will also cover aspects of privacy and other human elements of cybersecurity. Takes a general approach that will result in students prepared to learn about and defend themselves from current and future attacks.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 131","title":"Introduction to Data Analytics: Seeking Information in Data with Computation ","courseCredits":" (3 credits)","department":"Informatics","description":"This course will offer an introduction to the key terms, concepts and methods in data analysis, with an emphasis on developing critical analytical skills through hands-on exercises of actual data analysis tasks. In addition, students will learn and practice basic programming skills to use software tools in data analysis. Most importantly, this course aims to help students look at the data and their analysis from new points of view, and nurture a habit of finding relevant patterns in large data sets with appropriate analysis steps. This ability becomes particularly important when facing large amounts of data, be they from natural or social science, engineering or business.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 196","title":"Beginning Special Topics in Informatics ","courseCredits":" (3 credits)","department":"Informatics","description":"The contents of this course will vary from semester to semester. Each offering will cover an introductory topic in Informatics. May be repeated for credit when content varies.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 197","title":"Beginning Mini Special Topics in Informatics ","courseCredits":" (3 credits)","department":"Informatics","description":"The contents of this course will vary from semester to semester. Each offering will cover an introductory topic in Informatics. May be repeated for credit when content varies.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 200","title":"Research Methods for Informatics ","courseCredits":" (3 credits)","department":"Informatics","description":"In this course students will gain an understanding of key methods and techniques in research and will prepare to critically evaluate and engage in research. Topics covered will include: identifying and articulating research problems, posing research questions, research design, data collection strategies, quantitative and qualitative analyses, interpreting results of analyses, and concerns in human subject research. Prerequisite(s): C INF 100.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 201","title":"Introduction to Web Technologies ","courseCredits":" (3 credits)","department":"Informatics","description":"A technique-oriented introduction to client-based Web design and development technologies, including HTML/XHTML, CSS, JavaScript, digital imaging, file formats, etc.; also the elements of UNIX and networks necessary to understand and implement basic information management and transfer. Prerequisite(s):  C INF 100 or by permission of instructor.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 202","title":" Introduction to Data and Databases ","courseCredits":" (3 credits)","department":"Informatics","description":"This course introduces students to data and databases. It covers both long-standing relational (SQL) databases and newly emerging non-relational (NoSQL) data stores. The nature of data, Big Data, intellectual property, system lifecycle, and development collaboration are also explored. Team-based activities alternate with hands-on exercises. Prerequisite(s): I INF/C INF 108, I CSI 101, 105, 110 or I CSI/I CEN/ I ECE 201 or B ITM 215; not open to students who are taking or have completed I CSI 410 or 411 or B ITM 331.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 203","title":"Introduction to Networks and Systems ","courseCredits":" (3 credits)","department":"Informatics","description":"This course provides an introduction to computer networking and computer systems. The course covers the fundamentals of networked computing systems with an emphasis placed on the basics of network protocols and how they operate at all layers of the networking models. The course also introduces students to personal computer internal system components, storage systems, peripheral devices, and operating systems from an introductory computer architecture perspective.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 300","title":"Probability and Statistics for Data Analytics ","courseCredits":" (3 credits)","department":"Informatics","description":"Probability and statistical methods applied to the analysis of various kinds of data. Includes underlying theoretical justification and appropriateness for different models and analyses. Conceptual and implemented approaches to data analysis. Prerequisite(s): A MAT 108, I CSI/C INF 131.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 301","title":"Emerging Trends in Information and Technology ","courseCredits":" (3 credits)","department":"Informatics","description":"This course is designed to address challenges of the 21st century from the information science framework. The class will explore emerging technologies and discuss how they alter and create new information environments. Examples of these technologies include Big Data, 3D Printing, Social Media, Wearable Computing, etc. Attention will be paid to real world uses of these technologies, emphasizing how they are changing business, education, and government, including implications for emergency preparedness, homeland security, and cybersecurity. This course also focuses on career paths for digital citizens in the 21st century.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 302","title":"Human-Computer Interactive Design ","courseCredits":" (3 credits)","department":"Informatics","description":"This course examines human factors, Human-Computer Interaction aspects of application domains, human-centered evaluation, developing effective interfaces, accessibility, emerging technologies, and human-centered computing. Students learn several techniques for rapid prototyping and evaluating multiple interface alternatives and principles of visual design. Information visualization, user-interface software architecture, and formal methods in HCI will be explored. Prerequisite(s): C INF 301.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 303","title":"Intermediate Networking ","courseCredits":" (3 credits)","department":"Informatics","description":"This course is designed to convey the essentials of data communication networks. It will cover concepts, technologies and architectures. There will be practical lessons built into the semester's topics and assignments whenever possible. This course will build on the networking knowledge gained in C INF 203, covering the major conceptual areas balanced with practical discussions and exercises. It will also discuss important network management topics such as domain management and security. Prerequisite(s): C INF 203. Students who have taken C INF/IST 423 may not take C INF 303 for credit.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 304","title":"Intermediate Hardware and Operating Systems ","courseCredits":" (3 credits)","department":"Informatics","description":"The primary objective of this course is to provide the student with a detailed understanding of computer systems from an architectural perspective. The material covered in this course, which builds on that learned in C INF 203, is intended to form a foundation of technical knowledge for systems analysis, design, configuration, selection, and management. The primary emphasis is expanding students' technical knowledge of hardware and system software, with topics including advanced digital circuits, integrated circuits, application development, operating systems, file systems, and systems security. Prerequisite(s): C INF 203. Students who have taken C INF/C IST 424 may not take C INF 304 for credit.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 305","title":"Digital Project Management ","courseCredits":" (3 credits)","department":"Informatics","description":"This course provides an introduction to current practices in project management with a focus on the management of digital projects. It is intended to provide a broad overview of the concepts, issues, tools and techniques related to the management of digital projects from concept to completion. Topics covered include project manager role/responsibilities, project team structure, project documentation, project phases/SDLC, project management methodologies, troubled projects, digital analytics and more. Prerequisite(s): C INF 201 and C INF 202.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 306","title":"Information Security and Assurance ","courseCredits":" (3 credits)","department":"Informatics","description":"Technical aspects of cybersecurity in computer and network systems. The nature of attacks and defense in digital systems; models of vulnerabilities, threats, and security; cryptography; forensics; security policies and procedures; software and network security. Prerequisite(s): C INF 124X or C INF 203 or C EHC 242.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 307","title":"Current Topics in Social Media ","courseCredits":" (3 credits)","department":"Informatics","description":"In this course students will explore current topics and trends in social media. An emphasis will be placed on investigating and evaluating multiple social media outlets, writing across social media platforms, and current trends in managing social media programs and understanding the implications for emergency preparedness, homeland security, and cybersecurity. Prerequisite(s) C INF 301.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 308","title":"Programming for Informatics ","courseCredits":" (3 credits)","department":"Informatics","description":"Computer programming in an Informatics environment. The fundamentals of programming, including introduction to algorithms, object-oriented design, and data structures. Additional topics include basic interface design, security, networking, use of data bases, and mobile and other non-traditional computing platforms. Prerequisite(s): C INF 100 and C INF108 or I CSI/I ECE 201.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 362","title":"Intermediate Interactive Design ","courseCredits":" (3 credits)","department":"Informatics","description":"A technique-oriented intermediate exploration of client-based Web design and development technologies, using current and emerging technologies. Design, planning, security, administration and management of websites will also be examined. Prerequisite(s): I CSI 101, 105, 110, I CSI/I ECE 201, or C INF 201.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 363","title":"Digital Design ","courseCredits":" (3 credits)","department":"Informatics","description":"Students apply design theory to the development and delivery of digital media with emphasis on digital imagery, video, and music. Topics may include consumption of digital media on a variety of devices, creation, acquisition, editing and processing of digital content. Students will develop an appreciation for the role that each media element may contribute to the final user experience. Students will cultivate an understanding of how public policy issues apply to technology, in particular copyright, privacy, and freedom of expression. Prerequisite(s): C INF 201.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 395","title":"Internet Practicum ","courseCredits":" (3-6 credits)","department":"Informatics","description":"The course provides students the opportunity to work as a teaching aide and lab assistant in information science. Students will hold weekly lab assistant hours, monitor and respond to student questions on the class listserv, and provide feedback to the course instructor. May be repeated for credit up to a total of 6 credits with permission of department. Prerequisite(s): a grade of B or higher in C INF 100X and permission of instructor. S/U graded.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 398","title":"Field Experience in Informatics ","courseCredits":" (0-9 credits)","department":"Informatics","description":"This course provides academic structure and oversight to service-learning and community engagement components available as options in other Informatics offerings. The goal of the field experience course is to improve students' understanding of a topic explored during a semester length course. Courses will typically include guest speaker events, field excursions, and class session on-site (i.e. Montreal, New York City, etc.) The course topic will change from semester to semester based on the topic of the semester length course. A version of the course could be used to offer a stand-alone course with service learning, community service, internship and other community engagement activities as a central theme.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 401","title":"Case Studies in Digital Citizenship ","courseCredits":" (3 credits)","department":"Informatics","description":"The purpose of this course is for students to explore topics related to digital citizenship through the close examination of case studies. Students will be asked to look to current issues and cases involving digital citizenship and apply themes, such as the ethical use of information, in their examination and discussion of them. Prerequisite(s): C INF 301.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 403","title":"Advanced Networking and Security ","courseCredits":" (3 credits)","department":"Informatics","description":"This course is designed to provide an advanced coverage of networking with a specific focus on network security and cryptography. This course builds on the concepts and issues examined in I INF 404. Networking security is examined through a study of digital signatures and certificates, authentication protocols, and firewalls and key establishment and management. Also considered are security issues related to people's use of computer networks, communication channels, mobile devices, and the Internet. Also examined are new access control paradigms such as Java security and .NET security. Prerequisites: C INF 303, C INF 404, some programming experience.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 404","title":"Advanced Systems and Security ","courseCredits":" (3 credits)","department":"Informatics","description":"This course is designed to provide an advanced coverage of systems with a specific focus on cybersecurity. Engineered security is examined through the application and introduction to authentication protocols and intrusion detection for UNIX, Windows, databases, and general software security. Also considered are security issues related to people's use of systems including policies and practices for password management and protecting privacy rights. Students also study options for maintaining business continuity in the event of a disruption of business operations. Security models such as Bell-LaPadula are introduced and studied. Specific case studies are used to highlight the choices that must be made to balance operational efficiency of business functions with protecting the business from the onslaught of security threats. Prerequisite(s): C INF 304 and some programming experience.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 407","title":"Modern Issues in Databases ","courseCredits":" (3 credits)","department":"Informatics","description":"This is an advanced undergraduate course to introduce the students to emerging topics in database systems. This course is especially designed for junior/senior students with emphasis on advanced concepts and algorithms in database systems, topics that are state-of-the-art research, or recent seminal contributions in the broad field of database and information systems and will include discussions of security and privacy of information data systems. Prerequisite(s): C INF 202.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 428","title":"Analysis, Visualization, and Prediction in Analytics ","courseCredits":" (3 credits)","department":"Informatics","description":"Principles of data analysis, emphasizing modern statistical and machine-learning based approaches. Also, the important role of simple analyses and visualization to gain an overall understanding of data sets, regardless of size. The role of analytics in creating predictive models of phenomena. The importance of understanding the nature of the data and other methodological considerations. Prerequisite(s): C INF 300.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 451","title":"Bayesian Data Analysis and Signal Processing ","courseCredits":" (3 credits)","department":"Informatics","description":"This course will introduce both the principles and practice of Bayesian and maximum entropy methods for data analysis, signal processing, and machine learning. This is a hands-on course that will introduce the use of the MATLAB computing language for software development. Students will learn to write their own Bayesian computer programs to solve problems relevant to physics, chemistry, biology, earth science, and signal processing, as well as hypothesis testing and error analysis. Optimization techniques to be covered include gradient ascent, fixed-point methods, and Markov chain Monte Carlo sampling techniques. Only one of C INF 451, I CSI 451, or A PHY 451/451Y may be taken for credit. Prerequisite(s): A MAT 214 (or equivalent) and I CSI 101 or I CSI/I ECE 201.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 452","title":"Computer and Network Security ","courseCredits":" (3 credits)","department":"Informatics","description":"Theoretical, conceptual and practical aspects of computer and network security. The role of algorithms, systems, humans, software and hardware in computer and network vulnerabilities and defense. The two primary focuses of the course will be on the computer and networks, as centers of vulnerability and defense. The course will emphasize hands-on analysis of security issues. Prerequisite(s): C INF 306.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 453","title":"Information Security and Privacy ","courseCredits":" (3 credits)","department":"Informatics","description":"Security and privacy issues in computer and networked systems. The role of systems, design, implementation, etc. on data security in digital systems. Case studies of these roles and how they affect both data security and vulnerability. The legal and ethical aspects of data security and privacy. Prerequisite(s): C INF 306.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 454","title":"Human Aspects of Cybersecurity ","courseCredits":" (3 credits)","department":"Informatics","description":"The roles of individuals, groups, organizations and governments in computer and network security. How the interactions of these with the technical nature of digital systems in many cases forms the core of vulnerabilities. The trade-offs between security and various measures of utility. Conflicting definitions of security at different levels (e.g., governmental vs. individual). Societal measures and values of security. The course will feature case studies to explore many of these issues. Prerequisite(s): C INF 306.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 455","title":"Prevention and Protection Strategies in Cybersecurity ","courseCredits":" (3 credits)","department":"Informatics","description":"The role of security policies and design strategies to minimize security vulnerabilities in computer and networked systems. The affected areas range from the overall design of systems, networking protocols, operating systems, and applications software on individual computers to the role of coding standards and end user education in security. Prerequisite(s): C INF 306.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 462","title":"Current Technologies in Interactive Design ","courseCredits":" (3 credits)","department":"Informatics","description":"Provides an advanced coverage of web design and development, with a focus on current technologies and processes. Students will develop skills on the use of software development practices such as agile development and test-driven development. Develop familiarity with current technologies in particular web-based and mobile applications. Prerequisite(s): C INF 362 and C INF 363.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 463","title":"Professional Innovations I ","courseCredits":" (3 credits)","department":"Informatics","description":"Students from particular INF concentrations will represent their area of expertise on an individual or group project. The projects will either be real-life problems as presented by partnering external organizations or real-life problems as posed and solved by the group itself. A culminating paper, application, or presentation will be produced. The instructor will act as a mentor to the student teams and help to guide them through their projects. This is the first of a two-course series. Prerequisite(s): senior in Informatics major.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 464","title":"Professional Innovations II ","courseCredits":" (3 credits)","department":"Informatics","description":"Students from particular INF concentrations will represent their area of expertise on an individual or group project. The projects will either be real-life problems as presented by partnering external organizations or real-life problems as posed and solved by the group itself. A culminating paper, application, or presentation will be produced. The instructor will act as a mentor to the student teams and help to guide them through their projects. This is the second of a two-course series. Prerequisite(s): C INF 463, senior in Informatics major.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 465","title":"Senior Capstone in Informatics ","courseCredits":" (3 credits)","department":"Informatics","description":"Students create teams, each representing their specialization, to solve a current technology challenge. The purpose of this course is for students from all the different Informatics tracks to come together and work on a real world Informatics related problem. This course will require completion of 120 hours in a field placement. During their field placement, students will work as part of a team comprised of their peers from other Informatics tracks to complete a capstone project. The project itself will be dictated by the individual needs of the placement and the strengths of the team. The Instructor of C INF 465 will act as a mentor to the student teams and help to guide them through their projects. May be repeated for credit up to a total of 6 credits with permission of department. Prerequisite(s): Informatics seniors only and permission of instructor.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 466","title":"Independent Research ","courseCredits":" (3 credits)","department":"Informatics","description":"Student-initiated research project under faculty guidance. Students will present their research as appropriate. May be repeated for credit up to a total of 6 credits with permission of department. Prerequisite(s): Informatics juniors and seniors only.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 467","title":"Technology-Based Community Support ","courseCredits":" (3 credits)","department":"Informatics","description":"Students work on-site with a non-profit to provide technology support. Possible projects could include website creation and development, computer lab support, or networking. At least 120 hours/semester are required. Students will also meet with a faculty supervisor throughout the semester and complete a final presentation of their work. May be repeated for credit up to a total of 6 credits with permission of department. Prerequisite(s): Informatics juniors and seniors only.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 468","title":"Undergraduate Internship ","courseCredits":" (3 credits)","department":"Informatics","description":"The internship has two components: (1) work experience in position related to students interests in computing and information. Interns are expected to spend 8 hours per week during the semester at their internship location; (2) academic seminar where students and faculty mentor meet together monthly to discuss their experiences and general career preparation topics. Assignments may include preparing a resume and cover letter, career development, assessing skills for and barriers to career development, and planning for graduate or professional school. Students are expected to research, identify, and find their own possible internship opportunities. This activity will help students to identify their own career goals and manner in which they may best be achieved, and it will also help students to learn career preparation skills that will be useful after graduation. All internship opportunities must be reviewed and approved by appropriate faculty prior to course registration. May be repeated for up to 6 credits. Prerequisite(s): permission of instructor, junior or senior status and a minimum GPA of 2.50.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 469","title":"Internship for Fully Online Students ","courseCredits":" (9 credits)","department":"Informatics","description":"The internship has two components: (1) work experience in position related to the Information technology track. Interns are expected to spend at least 24 hours per week during the semester at their internship location; (2) online academic seminar where students and faculty mentor discuss their experiences and general career preparation topics. Assignments may include preparing a resume and cover letter, career development, assessing skills for and barriers to career development, and planning for graduate or professional school. Students are expected to research, identify, and find their own internship opportunities. This activity will help students to identify their own career goals and manner in which they may best be achieved, and it will also help students to learn career preparation skills that will be useful after graduation. All internship opportunities must be reviewed and approved by appropriate faculty prior to course registration. Prerequisite(s): permission of instructor, Informatics juniors and seniors only, IT online track only, fully online students.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 470","title":"Physical Computing ","courseCredits":" (3 credits)","department":"Informatics","description":"This course introduces programmable microcontrollers, digital chips that are used to control electronics and robotics projects. In this course students will simultaneously develop the electronic circuits and associated software for controlling hardware components including sensors and mechanical parts. Topics include electronics fundamentals, analog/digital (A/D) devices, pulse-width modulation (PWM) and embedded programming. Course has hands-on lab setting with a final group project. Prerequisite(s): junior or senior status.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 495","title":"Special Topics in Research, Applied and Experiential Learning ","courseCredits":" (3 credits)","department":"Informatics","description":"This course is designed to discuss selected topics related to research, application, and experiential learning in the fields of emergency preparedness, homeland security, cybersecurity, and informatics. Through the lectures, readings and class discussions students will develop a broad understanding of the different fields and their specific topics. The topics will be selected and announced by the instructor when offered. May be repeated for credit if content varies. Prerequisite(s): permission of instructor and junior or senior standing.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 495","title":"Intermediate Special Topics in Informatics ","courseCredits":" (3 credits)","department":"Informatics","description":"The contents of this course will vary from semester to semester. Each offering will cover an advanced topic in Informatics. May be repeated for credit when content varies. Prerequisite(s): permission of instructor, and junior or senior standing.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 497","title":"Intermediate Mini Special Topics in Informatics ","courseCredits":" (1 credits)","department":"Informatics","description":"The contents of this course will vary from semester to semester. Each offering will cover an advanced topic in Informatics. May be repeated for credit when content varies. Prerequisite(s): permission of instructor, and junior or senior standing.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"C INF 499W","title":"Senior Seminar in Informatics ","courseCredits":" (3 credits)","department":"Informatics","description":"This course helps students develop integral professional skills, including presentation of ideas through written and verbal communication, within an Informatics framework. Students will focus on a particular technology company or issue as a mechanism for developing critical thinking and teamwork skills. Prerequisite(s): Informatics seniors only.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"B.S. in Informatics"},{"courseCode":"IST 601","title":"The Information Environment ","courseCredits":" (3 credits)","department":"Information Science","description":"Provides a theoretical background for students entering the information science professions. Through guest speakers, field trips, a variety of readings, class discussion, lectures, and writing assignments, students gain knowledge of the critical themes in the field, such as information seeking, users, environments, policies, and ethics.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Combined BA-BS Emergency Preparedness, Homeland Security and Cybersecurity or BS Informatics with MS Information Science "},{"courseCode":"IST 602","title":"Information and Knowledge Organization ","courseCredits":" (3 credits)","department":"Information Science","description":"An introduction to fundamental concepts and theoretical principles of knowledge-organization models and techniques used to facilitate access to information resources. The emphasis in this course is on interdisciplinary ideas and concepts. General consideration of reference/information services, the kinds of knowledge, the kinds of formats in which knowledge is recorded, and the ways in which it is pursued and retrieved.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Combined BA-BS Emergency Preparedness, Homeland Security and Cybersecurity or BS Informatics with MS Information Science "},{"courseCode":"IST 608","title":"Research Methods ","courseCredits":" (3 credits)","department":"Information Science","description":"Basic research methods and statistics for students entering the information science professions. Covers descriptive and inferential statistics through correlation and regression; basic research process methods, quantitative and qualitative, and the creation of grant or research proposals. Prerequisites: Previous IST coursework recommended.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Combined BA-BS Emergency Preparedness, Homeland Security and Cybersecurity or BS Informatics with MS Information Science "},{"courseCode":"IST 614","title":"Administration of Information Agencies ","courseCredits":" (3 credits)","department":"Information Science","description":"Principles and theory of administration. Consideration of planning, organization, budgeting, personnel, standards, inter-institutional cooperation. Recommended: Ist 601.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Combined BA-BS Emergency Preparedness, Homeland Security and Cybersecurity or BS Informatics with MS Information Science "},{"courseCode":"IST 668","title":"Internship ","courseCredits":" (3-6 credits)","department":"Information Science","description":"Two 40 day sessions, for a total of 80 days or at least 400 hours. Opportunity for curriculum development, program development, research design, teaching, skill development and problem solving through observation and instructional practice, documented by formative assessments, in an information environment designed to meet the learning and information needs of all students, under the supervision of a faculty member and a certified tenured school library media specialist or other information professional. Prerequisites: 18 credits completed toward the Master's program, 100 hours of field experience and consent of advisor - See Internship Program Requirements.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Combined BA-BS Emergency Preparedness, Homeland Security and Cybersecurity or BS Informatics with MS Information Science "},{"courseCode":"INF 720","title":"Managing Information and Technology in Organizations ","courseCredits":" (2 credits)","department":"Informatics","description":"This course will introduce information systems research paradigms grounded in organization theory and provide a framework for applying theoretical concepts and empirical tools to the management of information and technology in organizations.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Doctor of Philosophy in Information Science"},{"courseCode":"INF 721","title":"Information and Society ","courseCredits":" (2 credits)","department":"Informatics","description":"Relationships between information and communication technologies (ICTs) and social action, how social and organizational factors influence information processes and systems, and how the use of ICTs influences our (changing) understanding and experience of dealing with information.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Doctor of Philosophy in Information Science"},{"courseCode":"INF 722","title":"Information Organization ","courseCredits":" (2 credits)","department":"Informatics","description":"Text analysis for information extraction, organization of information for knowledge sharing, and visualization of information to support users' diverse cognitive styles.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Doctor of Philosophy in Information Science"},{"courseCode":"INF 723","title":"Information and Computing ","courseCredits":" (2 credits)","department":"Informatics","description":"Development of theories and concepts that underlie the operation of information processing and retrieval systems; consequences derived from these theories that should be considered in designing such systems; theoretical foundations of information and computation; technologies and application areas.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Doctor of Philosophy in Information Science"},{"courseCode":"INF 724","title":"Information Policy ","courseCredits":" (2 credits)","department":"Informatics","description":"National and international information policy development trends, processes, and conflicts; policy, law, and culture; information economics, industries, and trade; policies of information commodities (e.g. intellectual property, privacy).","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Doctor of Philosophy in Information Science"},{"courseCode":"INF 711-714","title":"Research Seminar","courseCredits":" (1 credits)","department":"Informatics","description":"A four-semester sequence of 1-credit research seminars (INF 711, INF 712, INF 713, INF 714) will facilitate an understanding of information science literature and research and development of students' research agendas. Taken for the first four semesters in sequence, students will interact with faculty while learning about their current research; begin to use and evaluate information science literature; learn research techniques, such as writing a literature review, maintaining a bibliographic database, presenting a poster session and presenting current research at a conference; and develop research relationships with faculty and other students.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Doctor of Philosophy in Information Science"},{"courseCode":"INF 710","title":"Research Design in Information Science","courseCredits":" (4 credits)","department":"Informatics","description":"Students will examine research issues in information science at an advanced level, focusing on appropriate research design, data gathering techniques and analysis relating to data collection and measurement. Students will explore the research design process from both qualitative and quantitative points of view.","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Doctor of Philosophy in Information Science"},{"courseCode":"IST 701","title":"ProSeminar","courseCredits":" (3 credits)","department":"Information Science","description":"","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Certificate of Advanced Study in Library and Information Science"},{"courseCode":"IST 702","title":"Directed Readings in Information Science and Policy (subfield specified) ","courseCredits":" (3 credits)","department":"Information Science","description":"","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Certificate of Advanced Study in Library and Information Science"},{"courseCode":"IST 768","title":"Internship ","courseCredits":" (3 credits)","department":"Information Science","description":"","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Certificate of Advanced Study in Library and Information Science"},{"courseCode":"IST 780","title":"Major Research Seminar ","courseCredits":" (3-6 credits)","department":"Information Science","description":"","school":"College of Emergency Preparedness, Homeland Security and Cybersecurity","degree":"Certificate of Advanced Study in Library and Information Science"},{"courseCode":"I CSI 201","title":"Introduction to Computer Science ","courseCredits":" (4 credits)","department":"Computer Science","description":"This course first introduces with the elementary concepts of computer science such as CPU, memory, I/O devices and binary number system. It then focuses on developing basic programming skills. The topics include input and output data, data types, control structures, functions/methods, arrays, procedural and object-oriented programming concepts, and program debugging and compilation. Only one of I CEN 200 or I ECE 141 and I CEN/I CSI/I ECE 201 may be taken for credit. Prerequisites: no prerequisite; general mathematical knowledge and computer skills are recommended.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 210","title":"Discrete Structures ","courseCredits":" (4 credits)","department":"Computer Science","description":"Mathematical reasoning, propositions, predicates and quantifiers; Boolean algebra, logic minimization; sets, functions, sequences, matrix algebra; mathematical induction and recursion; number theory, modular arithmetic, counting, permutations and combinations. Only one of I CEN/I CSI/I ECE 210 may be taken for credit. Prerequisite(s): A MAT 112.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 213","title":"Data Structures ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course covers commonly used abstract data structures such as lists, stacks, queues, trees and graphs. The implementation and time-space analysis of these data structures is discussed in the context of recursion, sorting and searching algorithms.  May not be taken by students with credit for I CSI 310. Only one of I CEN/I CSI/I ECE 213 may be taken for credit. Must be completed with a grade of C or better to take I CEN/I CSI 333 or I ECE 233. Prerequisite(s): Grade of C or better in I CEN/I CSI 201, or I CEN 200 or I ECE 141.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 300Z","title":"Societal and Ethical Implications of Computing ","courseCredits":" (3 credits)","department":"Computer Science","description":"Current age challenges for governments, communities, and individuals related to development and implementation of computer technologies. General and professional ethics. Analysis of various moral aspects of computing (privacy, security, hacking, etc.) for making responsible decisions. Intellectual property concepts such as copyrights, patents, and trademarks. Elements of effective professional and technical communication and documentation. Prerequisite(s): any introductory course in computer science or related field; programming experience is a plus.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 311","title":"Principles of Programming Languages ","courseCredits":" (3 credits)","department":"Computer Science","description":"Introduction to the design and implementation of programming languages, including language features, paradigms and design decisions. Briefly covers functional and logical programming paradigms and reinforces object-oriented concepts. Discusses interpreters, compilers, transpires and virtual machines, including lexical analysis, parsing, semantic analysis, optimization, code generation. Introduction to automata and state machines. Prerequisite(s): Grade of C or better required in I CSI/I CEN 210 and I CSI/I CEN 213.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 333","title":"Programming at the Hardware Software Interface ","courseCredits":" (4 credits)","department":"Computer Science","description":"Instruction set architecture of contemporary computers; Boolean logic, memory, registers, instructions and interrupts. Assembly language programming; assembler passes, symbols, macros, function linkage and separate compilations. C language programming; syntax, control, types, abstractions, pointers and strings. Dynamic memory, standard and user written libraries. ANSI and C++ standards. Instruction set simulation. Only one version of I CSI/I CEN 333 or I ECE 233 may be taken for credit. Prerequisite(s): a grade of C or better in I CSI/I ECE 213.       ","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 400","title":"Operating Systems ","courseCredits":" (3 credits)","department":"Computer Science","description":"Design and implementation of operating systems. Topics include historical overview of operating systems and their principles, systems programming, file system organization and I/O, resource allocation, memory management and virtual memory, virtual machines, process scheduling and synchronization of concurrent processes, deadlock detection and prevention, and security. Only one of I CEN/I CSI/I ECE 400 may be taken for credit. Prerequisite(s): I CSI 404 or I ECE 233 (formerly I ECE 333).","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 401","title":"Numerical Methods ","courseCredits":" (3 credits)","department":"Computer Science","description":"Study of practical methods for the numerical solution of a variety of problems on a digital computer. Topics include roots of equations, numerical interpolation, numerical integration and differentiation; the evaluation of mathematical functions, least squares curve fitting; the solution of simultaneous linear equations, and matrix inversion.  Prerequisite(s): grade of C better in both I CSI/I CEN 213 and A MAT 220.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 402","title":"Systems Programming ","courseCredits":" (3 credits)","department":"Computer Science","description":"Programming aspects of operating systems. Topics covered include implementation of storage management, resource allocation, multi-processing, scheduling, synchronization, inter-process communication, and terminal I/O. Emphasis on projects to enhance subject understanding, problem solving, and programming skills. Prerequisite(s): Grade of C or better required in I CSI 333.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 403","title":"Design and Analysis of Algorithms ","courseCredits":" (3 credits)","department":"Computer Science","description":"Algorithm efficiency based on asymptotic notation and analysis for iterative and recursive algorithms. Algorithm design strategies: iterative, divide-and-conquer, greedy and dynamic programming. Set management including hashing, disjoint sets and heaps. Algorithms on graphs and trees.  Prerequisite(s): grade of C or better in both I CSI/I CEN/I ECE 210 and I CSI/I CEN/I ECE 213.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 404","title":"Assembly Programming and Computer Organization ","courseCredits":" (3 credits)","department":"Computer Science","description":"An introduction to the logical organization of the hardware components of computing systems. Topics include logic design from a functional point of view, data representation and processing, description of major components such as the central processing unit and memory, and control and communication within the components and in the system. Only one of I CSI/I CEN/I ECE 404 may be taken for credit. Prerequisite(s): grade of C or better in I CSI 333.   ","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 405","title":"Object Oriented Programming Principles and Practice ","courseCredits":" (3 credits)","department":"Computer Science","description":"Object oriented software design principles (abstraction, polymorphism and inheritance; design patterns) with emphases on how they are embodied in a contemporary programming language, the principles of the structure, features and operation of such languages and systems, and increasingly complex API examples, design and implementation problems and projects to build proficient design, problem solving, programming and technology skills. Class presentation and discussion of some team developed project designs. A brief review of Java basics is given but proficiency in Java is highly desirable for the current course. This is not a course for programming beginners. Prerequisite(s): C or better in I CSI/I ECE 213 or sufficient proficiency demonstrated to the instructor.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 407","title":"Human Computer Interaction ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course covers the fundamentals and concepts of design, implementation, and evaluation of human-computer interfaces. Topics include human cognitive aspects; user-centered design; design goals and principles; interface and interaction types; prototyping and construction; and evaluation methods. In order to make a balance between theory and practice, emphasis is placed on a course-end project involving design, implementation and evaluation of the user interface for a specific application. Prerequisite(s): grade of C or better in I CSI 311.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 409","title":"Automata and Formal Languages ","courseCredits":" (3 credits)","department":"Computer Science","description":"Introduction to the theory of computation. Models of computation including finite automata, push-down automata. Turing machines are examined along with their formal language counterparts such as regular, context-free and phrase-structured languages. Key results such as pumping lemmas and proofs of undecidability are covered. Additional topics may include computational complexity and applications to Computer Science. Prerequisite(s): grade of C or better in I CSI 311.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 410","title":"Database Systems ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course covers the fundamentals and concepts of design, implementation and use of databases. Topics include database system architectures, data abstractions and models, query languages, relational algebra and calculus, indexing mechanisms, data integrity, rollback and recovery mechanisms, access control, theory of database design, and access methods including interfaces to programming languages. Prerequisite(s): grade of C or better in both I CSI/I ECE 210 and I CSI/I ECE 213.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 416","title":"Computer Communication Networks ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course covers fundamentals in computer communication networks and the principles of distributed systems that leverage these networks. The course will focus on key Internet application architectures, principles and protocols, covering reliable data transfer and transport protocols; routing and forwarding; data link layer communications and principles of shared media access. Students will also be introduced to various physical layer techniques like error correction and bandwidth efficiency; content delivery networks; and software-defined networks. The students will apply their understanding of networking fundamentals while working on hands-on programming assignments, packet trace analysis and Internet measurements. Prerequisite(s): I CSI/I CEN 404 or I ECE 233 and A MAT 367 or A MAT 370. ","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 417","title":"Compiler Construction ","courseCredits":" (3 credits)","department":"Computer Science","description":"In this course, students construct a compiler of their own design. Lexical analysis, parsing, semantic analysis, code generation, error detection and recovery, runtime systems and linking are covered in depth with an emphasis on implementation.  Prerequisite(s): grade of C or better in both I CSI 333 and I CSI 409.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 418Y","title":"Software Engineering ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course covers advanced object-oriented design principles and software engineering principles, including understanding various software development methodologies, the software development life cycle, how to work with clients to derive requirements and create architecturally sound software, testing and quality assurance, software maintenance practices and how to build a software engineering team. Project work in contemporary concurrent and object-oriented languages.  Prerequisite(s): Grade of C or better in I CSI 311.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 421","title":"Discrete Mathematics with Applications ","courseCredits":" (3 credits)","department":"Computer Science","description":"A deeper coverage of the content of ICSI/IECE 210.  Propositional logic, proofs by induction and combinatorial analysis such as counting problems. Introduction to recurrence equations and graph theory.  Prerequisite(s): Grade of C or better in I CSI/I CEN 210.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 422","title":"Computer Graphics ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course covers the theory and practice of computer graphics. Topics include graphics hardware, point plotting techniques, two and three dimensional transformations, viewing and clipping, hidden surface removal, modeling three-dimensional shapes with polygon meshes, hierarchical modeling of three-dimensional objects, and lighting and shading techniques. Prerequisite(s): grade of C or better in both A MAT 220 and I CSI 333 or I ECE 233 (formerly I ECE 333).","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 424","title":"Computer Security ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course introduces students to the fundamental and technical problems surrounding computer security. The course reviews basic security concepts, design principles, and mechanisms. Throughout the course and based on hands-on exercises, students will develop an in-depth understanding of several vulnerabilities and corresponding countermeasures in system security, web security, and network security areas. Topics include privilege escalation, buffer overflow, race condition, SQL injection, cross-site scripting, packet spoofing, TCP attacks, and firewalls. Prerequisite(s): I CSI 333 or I ECE 233 (formerly I ECE 333).","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 426","title":"Cryptography ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course covers cryptographic methods ranging from classical to modern ciphers and their cryptanalysis. Topics include classical cryptography, modular arithmetic and number theory concepts relevant to cryptography, modern block and stream ciphers, public key cryptography, hash functions, digital signatures, secret sharing, and steganography.  Prerequisite(s): grade of C or better in both I CSI 210, and I CSI 333 or I ECE 233 (formerly I ECE 333).","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 431","title":"Data Mining ","courseCredits":" (3 credits)","department":"Computer Science","description":"A course on data mining (finding patterns in data) algorithms and their application to interesting data types and situations. We cover algorithms that address the five core data mining tasks: prediction, classification, estimation, clustering, and associations. Course projects will involve advanced topics such as algorithm developments for handling large data sets, sequential, spatial, and streaming data. Prerequisite(s): A MAT 220. Familiarity with Python (or similar scripting language) as well as elementary statistics (e.g. A MAT 370) is also necessary.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 432","title":"Network Science ","courseCredits":" (3 credits)","department":"Computer Science","description":"Social networks have become important tools for analyzing a wide array of human behaviors and interactions. This course discusses networks arising in many different contexts (e.g. worldwide web, viral marketing, sociology, epidemiology) and presents techniques for analyzing such networks. The goal is to understand how the structure of a network influences its behavior. The course covers the necessary background material in graph theory. Prerequisite(s): A MAT 220, I CSI 403. Familiarity with Python (or similar scripting language) and basic probability (e.g. A MAT 370) is recommended.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 433","title":"Multimedia Computing ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course lays the foundation to conduct research in the area of multimedia computing. The course covers state-of-the-art computational techniques and algorithms for multimedia content processing, compression, networking, fusion, summarization, search and retrieval applicable to different areas such as social media, homeland surveillance and cyber security and privacy. The objective of this course is to prepare students to i) understand the theoretical foundation of multimedia computing, and ii) apply computational tools such as Matlab and Intel OpenCV to the processing and analysis of multimedia data. Prerequisite(s): AMAT 220 and grade of C or better in I CSI 311.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 435","title":"Artificial Intelligence ","courseCredits":" (3 credits)","department":"Computer Science","description":"An introduction to the broad spectrum of approaches and techniques of Artificial Intelligence, such as search and planning problems, basic machine learning, Markov decision processes, reinforcement learning, Bayesian networks, propositional and first-order logic, and potentially introduction to deep learning. Prerequisite(s): grade of C or better in A MAT 220 or I CSI 311; A MAT 367 or A MAT 370, I CSI 401 and I CSI 403.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 436","title":"Machine Learning ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course provides an introduction to supervised and unsupervised learning (e.g., support vector machines, neural networks, k-nearest neighbor classifier, logistic and least squares regression), clustering methods, dimensionality reduction techniques (e.g., principal component analysis), and reinforcement learning theory. Prerequisite(s): grade of C or better in A MAT 214, A MAT 220, A MAT 367, and I CSI 401.     ","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 445","title":"Topics in Computer Science ","courseCredits":" (3 credits)","department":"Computer Science","description":"The contents of this course vary from semester to semester. Each offering covers an advanced senior-level topic in Computer Science. May be repeated for credit when content varies. Prerequisite(s): Grade of C or better in I CSI 311 and permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 451","title":"Bayesian Data Analysis and Signal Processing ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course will introduce both the principles and practice of Bayesian and maximum entropy methods for data analysis, signal processing, and machine learning. This is a hands-on course that will introduce the use of the MATLAB computing language for software development. Students will learn to write their own Bayesian computer programs to solve problems relevant to physics, chemistry, biology, earth science, and signal processing, as well as hypothesis testing and error analysis. Optimization techniques to be covered include gradient ascent, fixed-point methods, and Markov chain Monte Carlo sampling techniques. Only one version may be taken for credit. Prerequisite(s): A MAT 214 (or equivalent) and I CSI 101 or I CSI/I ECE 201. Normally offered in the fall.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 487/487Z","title":"Honors Seminar ","courseCredits":" (3 credits)","department":"Computer Science","description":"Each student is required to carry out independent study under the supervision of a faculty member and present a departmental colloquium on the chosen topic. Students may also be required to complete a theoretical or an experimental project, write reports or make short presentations. Only one version of I CSI 487 may be taken for credit. Prerequisite(s): admission to the honors program.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 488Z","title":"Honors Project ","courseCredits":" (3-12 credits)","department":"Computer Science","description":"Students are required to pursue research supervised by a faculty member and submit final reports describing their research. Outcomes of this research may include software/hardware artifacts, data collected through experiments, bibliographies or research papers. Each student is evaluated by a faculty committee during the second semester of their senior year. May be repeated for credit. Prerequisite(s): admission to the honors program.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 490","title":"Internship in Computer Science ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Research or development experience with University units or external agencies or companies requiring significant solutions of problems in areas such as software design, development, programming of tests or extensions, etc. in a practical environment. The relevance to computer science and the technical level of the proposed internship, and the intern's qualifications must be approved by the department. A written report must be accepted by the department before the end of the internship semester. May be repeated for credit. Prerequisite(s): grade of C or better in I CSI/I ECE 213. Students must have junior year standing with minimum GPA of 2.5. S/U Graded.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 497","title":"Independent Study in Computer Science ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Independent study of advanced topics under the guidance of a computer science faculty member which are not covered in regularly scheduled courses. Three to four hours per week per semester credit should be spent on readings, technology research, problem solving, experimentation with student created and existing software, faculty discussion, etc., culminating in an acceptable and significant written report or paper. May be repeated for credit. Prerequisite(s): junior or senior standing or equivalent experience, at least I CSI/I ECE 213 with a grade of C or better, and the permission of instructor with whom the student wishes to study.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"I CSI 499","title":"Capstone Project in Computer Science ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course involves integration and application of knowledge and skills acquired in earlier course work. Students participate in the design and production of a large, modular program typical of those encountered in business, industry, and research. Prerequisite(s): nine credits at the 400 level of computer science courses.","school":"College of Engineering and Applied Sciences","degree":"Undergraduate Degrees"},{"courseCode":"CSI 500","title":"Operating Systems ","courseCredits":" (4 credits)","department":"Computer Science","description":"Introduction to operating systems. Topics include processes, concurrency, synchronization, deadlock, memory management, segmentation, paging, replacement policies, caching, interprocess communication, file systems, and protection. Heavy emphasis on abstractions, mechanisms, policies, and design. Prerequisites: Csi 333 (formerly Csi 202), Csi 310, Mat 367 and one of Csi 400, 402, or 404.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 501","title":"Computational Linear Algebra, Nonlinear Algebra, and Optimization(","courseCredits":" (3 credits)","department":"Computer Science","description":"Review of numerical nonlinear algebra for one equation in one unknown. Numerical methods for solving systems of nonlinear equations including Quasi-Newton methods and descent techniques. Numerical solution of systems of linear equations including Gaussian elimination, LUD factorization, and iterative methods. Methods for banded and sparse systems. Approximation by splines. Prerequisite: Introductory undergraduate courses in numerical analysis, linear algebra, and multi-variate calculus. Knowledge of Fortran90 or Fortran77.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 502","title":"Computer Graphics ","courseCredits":" (3 credits)","department":"Computer Science","description":"An introduction to interactive computer graphics including device characteristics, display processors, and file structure. Graphical transformations and transformation systems including perspective transformations and hidden line and surface algorithms are discussed. Selected topics from graphical data structures, graphics systems, video graphics, and microprocessor graphics. Prerequisite: Csi 310.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 503","title":"Algorithms and Data Structures ","courseCredits":" (3 credits)","department":"Computer Science","description":"Review of discrete mathematics and probability used in algorithm design and analysis. Analyses of divide-and-conquer algorithms, number-theoretical algorithms, and algorithms for sorting, searching, and order statistics. Basic data structures. Basic graph algorithms for topological sorting, constructing minimum cost spanning trees, and shortest path problems. Prerequisites: Csi 310, departmental examination in discrete mathematics.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 504","title":"Computer Organization ","courseCredits":" (3 credits)","department":"Computer Science","description":"The organization of the hardware components of computing systems. Logic design theory review. Comparative survey of instruction set architectures. Design, control, communication, and interconnection strategies for major components such as arithmetic-logic units, control units, CPUs, memories, and I/O systems. Prediction and measurement of performance. Introduction to VLSI, parallel processing, and other current architectural trends. Prerequisites: Csi 404, departmental examination in discrete mathematics.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 508","title":"Database Systems I ","courseCredits":" (3 credits)","department":"Computer Science","description":"Basic concepts of a database system, with emphasis on database schema design, data manipulation languages, and query languages. Data models. Relational databases, functional dependencies, normal forms. Relational calculus, relational algebra, SEQUEL, Query-by-Example. The CODASYL network model: data definition and data manipulation languages. Computer project using a database system. User viewpoint of concurrent access. Prerequisites: Csi 310, departmental examination in discrete mathematics.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 509","title":"Theory of Computation ","courseCredits":" (3 credits)","department":"Computer Science","description":"Finite-state machines, pushdown stack automata, turing machines, context- free and context sensitive languages, regular sets, computability, NP- completeness. Prerequisite: Departmental examination in discrete mathematics.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 511","title":"Programming Languages and Systems Concepts ","courseCredits":" (3 credits)","department":"Computer Science","description":"Principles of program design, documentation, and software engineering. Assembly language, machine design, and the fetch-execute cycle at all levels of hardware and software. Introduction to software development, compiler design, operating systems design, and program verification. Prerequisite: Csi 310","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 515","title":"Combinatorial Algorithms ","courseCredits":" (3 credits)","department":"Computer Science","description":"Efficient algorithms for optimization and search problems involving networks and other combinatorial structures. Efficient solutions from integer, linear, or mixed programming formulations. Application of advanced data structures and algorithm analysis techniques to algorithms from current literature. Prerequisite: Csi 503.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 516","title":"Computer Communications Networks I ","courseCredits":" (3 credits)","department":"Computer Science","description":"Introduction to computer communication networks. Equal emphasis on all layers of the ISO reference model and the TCP/IP protocol suite. Topics include physical networks, sliding window protocols, remote procedure call, routing, naming and addressing, security, authentication, performance, and applications. Prerequisites: Csi 333 (formerly Csi 202), Csi 310, and Mat 367.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 517","title":"Compiler Design I ","courseCredits":" (3 credits)","department":"Computer Science","description":"Lexical analysis. Finite-state machines, pushdown machines, and context- free grammars. Top-down and bottom-up parsing. Syntax-directed translation. Prerequisites: Csi 310, departmental examination in discrete mathematics.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 518","title":"Software Engineering ","courseCredits":" (3 credits)","department":"Computer Science","description":"Software engineering principles, the role of abstraction in programming, abstract data types, modularization and module interfaces, specifications, and teamwork. Concurrent programming models, synchronization and interprocess communication. Project work in contemporary concurrent and object-oriented languages. Prerequisites: Graduate Csi standing or permission of instructor, Csi 310.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 519","title":"Advanced Programming Concepts ","courseCredits":" (3 credits)","department":"Computer Science","description":"The main focus of the course is on declarative programming and axiomatic semantics. In declarative programming we cover the Functional Programming (FP) and the Logic Programming (LP) paradigms. The emphasis in functional programming will be on programming with higher-order functions, and polymorphism as in the programing language ML. In Logic Programming we cover unification, SLD-resolution and backtracking, as in Prolog. Also covered are Floyd-Hoare axiomatic semantics, and verification of programs. Prerequisite: Extensive programming experience.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 520","title":"Topics in Distributed and Parallel Computing ","courseCredits":" (3 credits)","department":"Computer Science","description":"Selected areas relating to multiple processor systems will be examined. The models treated include various communication mechanisms and synchronous and asynchronous operation. Prerequisite: Consent of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 521","title":"Discrete Mathematics with Applications ","courseCredits":" (3 credits)","department":"Computer Science","description":"Deeper coverage of the content of Csi 210 at the graduate level. Proofs by induction, recursive definitions, and combinatorial analysis. Introduction to recurrence equations, graph theory, and abstract algebra. Applications to proofs, correctness, and analysis of combinatorial and algebraic algorithms. Prerequisite: Csi 210 or graduate standing.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 523","title":"Computational Geometry ","courseCredits":" (3 credits)","department":"Computer Science","description":"Efficient algorithms for geometric problems. Paradigms of divide and conquer, space sweep, locus computation, prune and search, transformation, and random sampling. Problems such as finding convex hulls, line intersections, Voronoi diagrams, and nearest neighbors are studied together with selections from research literature. Lower bound proofs, examples of parallel algorithms, and some implementation issues. Prerequisites: Departmental examination in descrete mathematics, Csi 503.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 524","title":"Information Security ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course covers the broad spectrum of technical issues surrounding computer security and intrusion detections. Topics considered include: viruses, worms, host-and network-based vulnerabilities and countermeasures, database security, intrusion detection, and privacy and legal issues. Facilities for securing hosts and limiting vulnerability are also discussed. Unlike in a systems administration class, detailed operational issues are not discussed. Prerequisites: Csi 500 or permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 525","title":"Mobile Wireless Networks ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course will focus on the state of the art of mobile wireless networks. We will begin with fundamentals in wireless network architectures, protocols and operations. We will learn how are wireless links different than wired and what challenges does this pose to network design and integration. We will study the architecture and operations of networks you use on a daily basis including Wi-Fi 802.11 and mobile cellular networks. We will then transition to our advanced topics by identifying and surveying pitfalls that shape the wireless capacity crunch. We will cover the state of the art of novel technologies for increased network capacity that have the potential to accommodate the multi-zettabytes traffic projections. The students will gain basic practical skills in mobile computing while working on homework assignments. They will also have the opportunity to learn new techniques and concepts while working on an original research project with the end goal of producing real publishable results. In addition, the students will gain experience in efficient reading and understanding of technical papers, and giving public technical presentations. Prerequisite: strong programming skills and ICSI516 or equivalent.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 526","title":"Cryptography ","courseCredits":" (3 credits)","department":"Computer Science","description":"The making of ciphers to encode information is the subject of cryptography. This course covers the field from its origins in early historic times through its most up-to-date implementations and uses in digital computers. Various ciphers will be shown and their security assessed. This latter is known as cryptoanalysis - the attempt to break cipher in order to read the underlying message. The course will emphasize how cryptography and cryptoanalysis are intimately related, and how the arms race between the two has motivated progress throughout their history. Prerequisites: Csi 503 and 518.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 530","title":"Introduction to Mathematical Logic ","courseCredits":" (3 credits)","department":"Computer Science","description":"Topics include logical validity, logical consequence, computerized theorem proving, compactness, soundness, consistency, completeness, and incmpleteness in the context of propositional logic, first order logic, Frege-Hilbert deduction and computerized Semantic Tableaus deduction. This course will survey Goedel's Completeness and Incompleteness Theorems along with decidability, undecidability and classification of theoretically computable and uncomputable problems. Prerequisites: Departmental Discrete Math Exam.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 531","title":"Data Mining ","courseCredits":" (3 credits)","department":"Computer Science","description":"A course on data mining (finding patterns in data) algorithms and their application to interesting data types and situations. We cover the basic algorithms that address the five core data mining tasks: prediction, classification, estimation, clustering and associations. Course projects will involve advanced topics such as algorithm developments for handling large data sets, sequential, spatial and streaming data. Prerequisite: Familiarity with Python (or similar scripting language) as well as elementary statistics (e.g. A MAT 370) is also necessary. Contact the instructor for exceptions.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 532","title":"Network Science ","courseCredits":" (3 credits)","department":"Computer Science","description":"Social networks have become important tools for analyzing a wide array of human behavior and interactions. This course will consider networks arising in many different contexts (e.g. worldwide web, viral marketing, sociology, and epidemiology) and present techniques for analyzing such networks. The goal is to investigate the topology and dynamics of such networks, aiming to better understand the behavior, function, and properties of the underlying systems, as well as to understand how network structure influences its behavior. The course will cover the necessary background material in graph theory. The course will particularly emphasize on students ability to develop critical analytical skills through hands-on exercises of actual networking data analysis tasks. Prerequisites: ICSI131 or ICSI431, and ICSI403 or permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 533","title":"Theory and Practice of Multimedia Computing ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course lays the foundation for students to conduct research in the area of multimedia computing applications. Multimedia computing involves automated processing and analysis of multiple types of data such as text, images, and videos and audio, in a way that whole is greater than the sum of its parts. The course covers state-of-the-art computational techniques and algorithms for multimedia content processing, compression, networking, fusion, summarization, search and retrieval applicable to different areas such as social media, homeland surveillance and cyber security and privacy. The objective of this course is to prepare students to i) understand the theoretical foundation of multimedia computing, and ii) apply computational tools such as Matlab and Intel OpenCV to the processing and analysis of multimedia data. Prerequisite: CSI 310 or permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 535","title":"Artificial Intelligence I ","courseCredits":" (3 credits)","department":"Computer Science","description":"A first course in artificial intelligence (AI) introducing basic concepts and techniques. Topics include problem representation, production systems, heuristic search, predicate logic, and structured representation of knowledge. Techniques of sample search and sample problem solving systems are represented. Exercises in a selected AI programming language. Prerequisites: Csi 310, departmental examination in discrete mathematics.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 536","title":"Machine Learning ","courseCredits":" (3 credits)","department":"Computer Science","description":"Machine learning is an important and rapid growing branch of artificial intelligence. The aim of machine learning is to design algorithm that can extract information from environment automatically and improve its ability to perform the intended task. Currently, machine learning has been applied in various fields including engineering, bioinformatics, data mining and neurosciences, to name a few. This course provides a broad introduction to machine learning. Specifically, topics that will be covered in the class may include: numerical optimization methods that are essential for machine learning algorithms dimension reduction methods: principal component analysis & ISOMAP classification methods: linear discriminant analysis, k-nearest neighbor classifier, and logistic regression regression methods: least squares regression, ridge regression, and l1 regularized least squares regression (LASSO) clustering methods: k-means clustering and EM algorithm neural networks support vector machines for classification and regression. Prerequisites: basic knowledge of Linear Algebra (AMAT 220 or equivalent), Multivariate calculus (AMAT 214 or equivalent), Discrete probability (AMAT 367 or equivalent), Numerical methods (CSI 401 or equivalent).","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 538","title":"Computational Logic ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course is on computational issues in logic, with emphasis on automated reasoning and applications. Core material includes propositional logic, satisfiability, the first-order predicate calculus, Skolem functions, Herbrands theorem, unification, clausal resolution and paramodulation. Other topics covered may change from year to year. Prerequisites: Departmental examination in discrete mathematics, Csi 503.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 539","title":"Advanced Data Structures ","courseCredits":" (3 credits)","department":"Computer Science","description":"Data structures for efficient retrieval in the context of problems relating to aggregation, reporting, quantifier evaluation, and range queries in both dynamic and static settings. K-d trees, k-fold trees, balanced trees, and other advanced topics. Prerequisite: Csi 503.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 540","title":"High Performance Scientific Computing I ","courseCredits":" (3 credits)","department":"Computer Science","description":"Introduction to distributed, shared memory, and non-uniform memory advanced architectures, advanced networks, advanced parallel and distributed languages supporting scientific computing. Basic linear algebra algorithms and their relation to decomposition, memory access patterns, and scalability. High-level prototyping languages, experimental methods, performance analysis and polyalgorithms design. Prerequisites: Csi 310, Csi 401 or knowledge of numerical methods; knowledge of Fortran recommended.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 541","title":"High Performance Scientific Computing II ","courseCredits":" (3 credits)","department":"Computer Science","description":"Numerical methods of ODE's, PDE's and transform (FFT) suitable for advanced parallel and distributed computing. Explicit versus implicit message generation and processing in distributed computing environments. Advanced experimental methods. High Performance Fortran. Prerequisite: Csi 540","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 542","title":"An Introduction to Quantum Computation, Information, and Simulation ","courseCredits":" (3 credits)","department":"Computer Science","description":"The main ideas of Quantum Computation, Information, and Simulation are introduced. The course describes what quantum computation is and how it can be used to solve problems faster than classical computers. The challenges of building a quantum computer are addressed. Quantum simulators are explained and built illustrating the vast differences between quantum and classical gates. The course also covers quantum information, explaining how quantum states can be used to program communications. Prerequisites: Csi 403 or Csi 503, knowledge of the use of Boolean Algebra in circuit design, and programming experience.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 550","title":"Information Retrieval ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course will discuss theory and practice of searching and retrieval of text and bibliographic information. Topics covered include automated indexing, statistical and linguistic models, text classification, Boolean and probabilistic approaches to indexing, query formulation and output ranking, information routing and filtering, topic detection and tracking, as well as measures of retrieval effectiveness, including relevance, utility, miss/false-alarm. Techniques for enhancing retrieval effectiveness including relevance feedback, query reformulation, thesauri, concept extraction, and automated summarization. Experimental retrieval approaches from Test Retrieval Conferences (TREC); modern internet search engines (Google, AltaVista, etc.) Prerequisites: Csi 210, Csi 310; or Ist 301/601, Ist 602; or Ist 433/633; or Permission of Instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 551","title":"Bayesian Data Analysis and Signal Processing ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course will introduce both the principles and practice of Bayesian and maximum entropy methods for data analysis, signal processing, and machine learning. This is a hands-on course that will introduce MATLAB computing language for software development. Students will learn to write their own Bayesian computer programs to solve problems relevant to physics, chemistry, biology, earth science, and signal processing, as well as hypothesis testing and error analysis. Optimization techniques to be covered include gradient ascent, fixed-point methods, and Markov chain Monte Carlo sampling techniques. Prerequisites: Csi 101 or Csi 201, Mat 214, or equivalents, or permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 580","title":"Computer Science in Scientific Disciplines ","courseCredits":" (3 credits)","department":"Computer Science","description":"Uses of high speed digital computers in science. Fundamentals of operation of a stored program digital computer. Scientific computer languages. Elementary numerical methods. Algebraic manipulation on a digital computer. May not be used for degree credit in computer science. Prerequisites: Two semesters of calculus.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 600","title":"Distributed Systems ","courseCredits":" (3 credits)","department":"Computer Science","description":"Survey of current trends in operating systems with a particular emphasis on distributed systems. Topics include multiprocessor systems, distributed file systems, caching and cache coherency, scaling issues, naming, resource location, process migration, heterogeneity, remote procedure call, communication protocols, authentication, security, and replication. Prerequisite: Csi 500.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 601","title":"Computability and Undecidability ","courseCredits":" (3 credits)","department":"Computer Science","description":"Introduction to theory of computability. Topics include formal models of computing systems and their computational equivalence, Church's thesis, recursive and recursively enumerable sets, effective reducibilities, the recursion theorem and the arithmetic hierarchy. Applications to computer science, logic and mathematics. Prerequisite: Csi 509.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 604","title":"Computers and Computational Intractability ","courseCredits":" (3 credits)","department":"Computer Science","description":"Introduction to theory of computational complexity. Computational tractable and intractable problems. The complexity classes P, RP, NP, PSPACE, etc. Classification of commonly encountered problems from computer science, mathematics and operations research, emphasizing the NP-complete problems. Techniques for dealing with computational intractability including back-tracking, approximation algorithms, etc. Prerequisite(s): Csi 503 and Csi 509 or consent of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 608","title":"Database II ","courseCredits":" (3 credits)","department":"Computer Science","description":"Systems-oriented aspects of database systems design. Transaction processing, database concurrency control, restart and recovery, distributed databases. Advanced topics of current research interest. Prerequisites: Csi 310, departmental examination in discrete mathematics.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 616","title":"Computer Communication Networks II ","courseCredits":" (3 credits)","department":"Computer Science","description":"Survey of current trends in computer communication networks. Topics include transaction oriented protocols, bulk data transfer protocols, high speed networks, routing, protocol performance and efficiency, security, and authentication. Prerequisite: Csi 516.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 617","title":"Compiler Design II ","courseCredits":" (3 credits)","department":"Computer Science","description":"Code generation. Object code optimization and data flow analysis. Run- time implementation of programming languages. Prerequisites: Csi 333 (formerly Csi 202) and Csi 517.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 628","title":"Cryptographic Protocols ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course is on analyzing cryptographic protocols on security issues. The emphasis will be on formal methods, i.e., logically analyzing the protocols to establish the presence or absence of security flaws. The students will read and present latest cutting-edge literature and there will be a term project. Prerequisites: Csi 503 (or equivalent) as a co-requisite, departmental examination in Discrete Mathematics, CSI 524 or 526.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 635","title":"Artificial Intelligence II ","courseCredits":" (3 credits)","department":"Computer Science","description":"A continuation of the materials introduced in Csi 535. Prerequisite: Csi 535.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 636","title":"Natural Language Processing ","courseCredits":" (3 credits)","department":"Computer Science","description":"Construction of programs that use human language. Topics include morphology, syntax, parsing, semantic representation, resolution of ambiguity, generation, and discourse. Prerequisite: Csi 535 or permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 642","title":"Topics in Quantum Computation, Information, and Simulation ","courseCredits":" (3 credits)","department":"Computer Science","description":"This course is a follow up to Csi 542, an Introduction to Quantum Computation, Information, and Simulation. Topics covered will change from semester to semester. Detailed in-depth studies of these topics may include: quantum computation including theoretical aspects, numerical aspects of quantum mechanical computation, quantum information theory including quantum error correction, and quantum simulation. Prerequisites: Csi 442 or Csi 542.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 654","title":"Seminar in Problem Solving ","courseCredits":" (3 credits)","department":"Computer Science","description":"Methods of problem solving in computer science, including logical analysis and thought-experiments. Problems from all areas of computer science. Prerequisite: Admission to CSI doctoral program or consent of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 660","title":"Topics in Computer Science ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Advanced topics in computer science. Content determined by the instructor. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 661","title":"Topics in Artificial Intelligence ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Advanced study in selected subjects in Artificial Intelligence, with an emphasis on current research and results. Topics may be drawn from automated deduction, natural language processing, artificial neural networks, knowledge representation, and machine learning. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 662","title":"Topics in Database Systems ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Selected topics of current interest from the frontiers of database systems. Topics may vary from year to year. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 663","title":"Topics in Parallel Computation ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Selected topics of current interest in parallel processing. General topics include design and analysis of efficient parallel algorithms on a variety of parallel computation models, and theory of parallel computation. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 664","title":"Topics in Automated Reasoning ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Contents may vary from semester to semester. Possible topics include: automated reasoning methods based on term rewriting, completion, non- clausal approaches to theorem proving, dissolution, proofs by induction; theorem proving methods for nonclassical logics including modal, temporal, and multiple-valued logics; automated geometric theorem proving, geometric and algebraic reasoning, as well as constraint solving. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 665","title":"Topics in Computer Graphics ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Topics may include: Hidden line and surface removal, polygonal surfaces, fractals. B-spline and Bezier bicubic patches, Quadric surfaces, surface blending, shading, ray tracing, or animation. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 666","title":"Topics in Theory of Computation ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Selected topics in theory of computation, automata theory, and decidability. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 667","title":"Topics in Algorithms ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Selected topics in theory, analysis, and complexity of algorithms. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 668","title":"Topics in Systems Architecture ","courseCredits":" (3 credits)","department":"Computer Science","description":"Selected topics or case studies in structure, design, or evaluation of computer hardware and software systems. Content varies from year to year. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 669","title":"Topics in Data Structures ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Course contents may vary from semester to semester. General topic is efficient algorithms for searching data structures and data bases; particular topics may include perfect hashing, fast tries, fusion trees, and relational data base optimization. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 670","title":"Topics in Specification and Verification ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Course based on the application of formal methods for specification and verification of software and hardware. Emphasis on using mechanical theorem-provers to verify that the program/circuit meets the specification. Contents may vary from semester to semester. May be repeated for credit with permission of the department. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 671","title":"Computer Vision ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Billions of images are hosted publicly on the web - how can you find one that \"looks like\" some image you are interested in? How can a robot identify objects in complex environments, or navigate uncharted territory? How can a video camera in the operating room help a surgeon plan a procedure more safely, or assist a radiologist in more efficiently detecting a tumor? Computer vision is at the heart of many such questions: the goal is to develop methods that enable a machine to \"understand\" or analyze images and videos, so that information can be derived from raw pixel values to support various applications. In this course, through lectures, paper presentations, and projects, we will explore fundamental topics including image formation, feature detection, segmentation, recognition and learning, and motion and tracking. We will treat computer vision as a process of inference from noisy and uncertain data and emphasize probabilistic, statistical, and data-driven approaches. Prerequisites: This course requires familiarity with calculus, basic probability theory and linear algebra, and some programming experience. Previous experience with image processing and machine learning will be useful but is not assumed. MATLAB, the language of choice for the programming assignments will be covered as part of the introduction to the course.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 680","title":"Computer Science Research ","courseCredits":" (3 credits)","department":"Computer Science","description":"Introduction to independent research in computer science. Satisfactory completion fulfills project requirement for the M.S. or Ph.D. in computer science. May be repeated for credit. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 680C","title":"Master's Research Project Continuation ","courseCredits":" (1 credits)","department":"Computer Science","description":"Load Graded. Appropriate for master's students engaged in research on the master's project beyond the level applicable to their degree program.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 681","title":"Compiler Project ","courseCredits":" (3 credits)","department":"Computer Science","description":"Project work in compiler design and implementation. Students are required to design and implement significant components of a compiler. Satisfactory completion fulfills project requirements for the M.S. or Ph.D. in computer science. Prerequisite: Csi 517 (corequisite: Csi 617) or permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 682","title":"Database Project ","courseCredits":" (3 credits)","department":"Computer Science","description":"Project work in database design and implementation. Students will design and implement significant components of a database system. Satisfactory completion fulfills project requirement for the M.S. or Ph.D. in Computer Science. Prerequisite: Csi 508 (corequisite: Csi 608 or Csi 609) or permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 683","title":"Systems Programming Project ","courseCredits":" (3 credits)","department":"Computer Science","description":"Project work in operating systems. Students will design and implement significant components of an operating system, subsystem, or supporting utility programs. Satisfactory completion of this course fulfills the project requirement for the M.S. or Ph.D. degree in computer science. Prerequisite: Csi 500 or permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 684","title":"Computational Science Project ","courseCredits":" (3 credits)","department":"Computer Science","description":"The computer solution of practical problems in pure or applied science and/or technology. Satisfactory completion fulfills project requirements for the M.S. or the Ph.D. in computer science. Prerequisites: Csi 540, 541, or consent of department.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 694","title":"Directed Readings in Computer Science ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Directed reading in a particular area of computer science specialization under supervision of a departmental faculty member. May be repeated for credit with permission of the department. Prerequisite: Consent of department.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 696","title":"Independent Teaching and Learning ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Participants extend and apply their understanding of computer science by tutoring or assisting in laboratory, tutoring or discussion activities, under faculty supervision, for one or more associated courses. One weekly contact hour and grading are required for each credit (or an equivalent obligation as determined by the faculty supervisor). Students must complete at least one relevant ITAL/ FTR training workshop during the semester in which they are enrolled in ICSI 696. May be repeated for credit with permission of the department. Prerequisite: Consent of department.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 697","title":"Independent Study and Research ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Independent study and research in a particular area of computer science specialization under supervision of a departmental faculty member. May be repeated for credit with permission of the department. Prerequisite: Consent of department.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 698","title":"Internship ","courseCredits":" (3 credits)","department":"Computer Science","description":"Directed application of a particular area of computer science specialization via public or private sector employment.  Must be under supervision of a departmental faculty member.  The internship must demonstrate the ability to put science and/or managerial preparation to work in business, industry, or government.  May not be repeated for credit.  Qualifies for CPT for one semester only.  Prerequisite: Permission of the department.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 698C","title":"Master's Internship Continuation ","courseCredits":" (1 credits)","department":"Computer Science","description":"Load Graded. Appropriate for master's students engaged in the master's internship beyond the level applicable to their degree program.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 699","title":"Master's Thesis ","courseCredits":" (3-6 credits)","department":"Computer Science","description":"Original independent research at the master's level under direction of a member of computer science faculty. Prerequisite: Acceptance of thesis proposal by faculty member.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 699C","title":"Master's Thesis Continuation ","courseCredits":" (1 credits)","department":"Computer Science","description":"Load Graded. Appropriate for master's students engaged in the master's thesis beyond the level applicable to their degree program.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 720","title":"Advanced Topics in Computer Science ","courseCredits":" (1-3 credits)","department":"Computer Science","description":"Selected advanced topic from the current computer literature in computer science. Course material is at the doctoral level. Prerequisite: Permission of instructor.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 890","title":"Independent Study and Research ","courseCredits":" (3-12 credits)","department":"Computer Science","description":"Independent study at the doctoral level under the direction of a member of the computer science faculty. May be repeated for credit. Prerequisite: Consent of computer science department doctoral committee.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"},{"courseCode":"CSI 899","title":"Doctoral Research ","courseCredits":" (1 credits)","department":"Computer Science","description":"Required of all candidates completing the degree of Doctor of Philosophy. Registration for this course is limited to doctoral students who have been admitted to candidacy.","school":"College of Engineering and Applied Sciences","degree":"Graduate Degrees"}]